[
    {
        "Date": "Mon May 20",
        "Title": "Titus 1",
        "Abbreviated": "Titus.1",
        "Xreference": "['1John.2.4', 'Isa.29.13', 'Rom.14.14', 'Eph.5.6', 'Ezek.33.31']",
        "Tags": " "
    },
    {
        "Date": "Tue May 21",
        "Title": "Titus 2",
        "Abbreviated": "Titus.2",
        "Xreference": "['1Tim.2.4', 'Eph.2.8', 'Heb.9.14', 'Prov.31.10-Prov.31.31', 'Ezek.36.27']",
        "Tags": "\"For the grace of God has appeared, bringing salvation for all people, training us to renounce ungodliness and worldly passions, and to live self-controlled, upright, and godly lives in the present age.\" (Titus 2:11-12)\n\nThis verse highlights the transformative power of God's grace, which not only offers salvation but also teaches believers to live righteous and disciplined lives in response."
    },
    {
        "Date": "Wed May 22",
        "Title": "Titus 3",
        "Abbreviated": "Titus.3",
        "Xreference": "['Eph.2.8-Eph.2.9', '2Tim.1.9', '1Cor.6.11', 'Rom.16.17', '1Pet.3.21']",
        "Tags": "\"Not by works of righteousness which we have done, but according to His mercy He saved us, through the washing of regeneration and renewing of the Holy Spirit.\" (Titus 3:5)\n\nThis verse emphasizes that salvation is not based on our own deeds but on God's mercy, highlighting the transformative power of the Holy Spirit in believers' lives."
    },
    {
        "Date": "Thu May 23",
        "Title": "Daniel 1",
        "Abbreviated": "Dan.1",
        "Xreference": "['Matt.13.43', 'Ps.141.4', 'Prov.4.18', 'Isa.26.19', 'John.5.28-John.5.29']",
        "Tags": "\"Daniel resolved that he would not defile himself with the king's food, or with the wine that he drank.\" (Daniel 1:8)\n\nThis verse highlights Daniel's commitment to his beliefs and principles, showcasing his refusal to compromise his faith in the face of pressure from a powerful authority."
    },
    {
        "Date": "Fri May 24",
        "Title": "Daniel 2:1-16",
        "Abbreviated": "Dan.2",
        "Xreference": "['Ps.75.5-Ps.75.7', 'Ps.31.14-Ps.31.15', 'Job.12.22', 'Ps.113.7-Ps.113.8', 'Luke.1.32-Luke.1.33']",
        "Tags": "\"And in the second year of the reign of Nebuchadnezzar, Nebuchadnezzar dreamed dreams, wherewith his spirit was troubled, and his sleep brake from him.\" (Daniel 2:1)\n\nThis verse is significant because it sets the stage for the entire narrative of Daniel 2, highlighting the pivotal moment that leads to the revelation of God's sovereignty and the interpretation of creation's future through dreams."
    },
    {
        "Date": "Sat May 25",
        "Title": "Daniel 2:17-30",
        "Abbreviated": "Dan.2",
        "Xreference": "['Ps.75.5-Ps.75.7', 'Ps.31.14-Ps.31.15', 'Job.12.22', 'Ps.113.7-Ps.113.8', 'Luke.1.32-Luke.1.33']",
        "Tags": "\"And Daniel answered and said: 'Blessed be the name of God forever and ever, for wisdom and might are His.'” (Daniel 2:20)\n\nThis verse highlights Daniel's acknowledgment of God's sovereignty and wisdom, which serves as a foundation for understanding the unfolding events of the kings and kingdoms depicted in the book of Daniel."
    },
    {
        "Date": "Sun May 26",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon May 27",
        "Title": "Daniel 2:31-49",
        "Abbreviated": "Dan.2",
        "Xreference": "['Ps.75.5-Ps.75.7', 'Ps.31.14-Ps.31.15', 'Job.12.22', 'Ps.113.7-Ps.113.8', 'Luke.1.32-Luke.1.33']",
        "Tags": "\"And in the days of those kings the God of heaven will set up a kingdom that shall never be destroyed, nor shall the kingdom be left to another people. It shall break in pieces all these kingdoms and bring them to an end, and it shall stand forever.\" (Daniel 2:44)\n\nThis verse is significant as it highlights the establishment of God's eternal kingdom, which triumphs over all earthly powers, offering hope and assurance of divine sovereignty."
    },
    {
        "Date": "Tue May 28",
        "Title": "Daniel 3",
        "Abbreviated": "Dan.3",
        "Xreference": "['Rom.8.31', 'Isa.43.2', 'Luke.1.37', 'Ps.27.1-Ps.27.2', 'Heb.7.25']",
        "Tags": "\"Shadrach, Meshach, and Abednego answered and said to the king, 'O Nebuchadnezzar, we have no need to answer you in this matter. If this be so, our God whom we serve is able to deliver us from the burning fiery furnace, and he will deliver us out of your hand, O king. But if not, be it known to you, O king, that we will not serve your gods or worship the golden image that you have"
    },
    {
        "Date": "Wed May 29",
        "Title": "Daniel 4",
        "Abbreviated": "Dan.4",
        "Xreference": "['Ps.135.6', 'Job.42.2', 'Ps.115.3', 'Dan.4.25', 'Eph.1.11']",
        "Tags": "The most significant verse from Daniel 4 is: \"His dominion is an everlasting dominion, and his kingdom endures from generation to generation.\" (Daniel 4:34)\n\nThis verse highlights the sovereignty of God over all earthly kingdoms, affirming His eternal authority and the transient nature of human power."
    },
    {
        "Date": "Thu May 30",
        "Title": "Daniel 5",
        "Abbreviated": "Dan.5",
        "Xreference": "[]",
        "Tags": "\"Mené, Mené, Tekel, and Parsin.\" (Daniel 5:25)\n\nThis verse is significant because it contains the chilling message that signifies the end of King Belshazzar's reign, revealing the themes of divine judgment and the inevitability of accountability before God."
    },
    {
        "Date": "Fri May 31",
        "Title": "Daniel 6",
        "Abbreviated": "Dan.6",
        "Xreference": "['Heb.11.33', '2Tim.4.17', 'Ps.55.17', 'Ps.37.39-Ps.37.40', 'Dan.5.14']",
        "Tags": "\"The king said to Daniel, 'May your God, whom you serve continually, rescue you!'\" (Daniel 6:16)\n\nThis verse highlights the unwavering faith that Daniel represents and the acknowledgment of God's power even by those outside of Daniel's faith community, underscoring the theme of divine deliverance and faith amidst adversity."
    },
    {
        "Date": "Sat Jun 01",
        "Title": "Psalm 8",
        "Abbreviated": "Ps.8",
        "Xreference": "['Ps.34.9-Ps.34.10', 'John.10.34-John.10.36', 'Prov.2.7', 'Matt.6.33', 'Phil.4.19']",
        "Tags": "\"What is mankind that you are mindful of them, human beings that you care for them?\" (Psalm 8:4)\n\nThis verse captures the profound humility and wonder of humanity's place in the universe, highlighting the significance of divine attention amidst our smallness in creation."
    },
    {
        "Date": "Sun Jun 02",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"For an overseer, as God’s steward, must be above reproach. He must not be arrogant or quick-tempered or a drunkard or violent or greedy for gain.\" (Titus 1:7)\n\nThis verse is significant as it sets a standard for church leaders, emphasizing the importance of moral integrity and self-control in their role."
    },
    {
        "Date": "Mon Jun 03",
        "Title": "Daniel 7",
        "Abbreviated": "Dan.7",
        "Xreference": "['Matt.26.64', 'Rev.1.7', 'Luke.21.27', 'Rev.14.14', 'Matt.24.30']",
        "Tags": "\"One like a son of man was coming, and He came up to the Ancient of Days and was presented before Him.\" (Daniel 7:13)\n\nThis verse is significant as it introduces the concept of the \"Son of Man,\" highlighting the divine authority and messianic nature of Jesus Christ in Christian theology."
    },
    {
        "Date": "Tue Jun 04",
        "Title": "Daniel 8",
        "Abbreviated": "Dan.8",
        "Xreference": "[]",
        "Tags": "\"Then I heard a holy one speaking, and another holy one said to the one who spoke, 'For how long is the vision concerning the regular burnt offering, the transgression that makes desolate, and the giving over of the sanctuary and the host to be trampled underfoot?'\" (Daniel 8:13)\n\nThis verse is significant as it highlights the prophetic nature of the vision and the profound questions regarding the desolation and suffering of God's people, setting the stage for the themes of"
    },
    {
        "Date": "Wed Jun 05",
        "Title": "Daniel 9",
        "Abbreviated": "Dan.9",
        "Xreference": "['Jer.33.3', 'Jer.29.10-Jer.29.13', 'Rom.8.28', 'Exod.20.6', 'Jer.29.10']",
        "Tags": "\"Seventy weeks are decreed upon thy people and upon thy holy city, to finish the transgression, and to make an end of sins, and to make reconciliation for iniquity, and to bring in everlasting righteousness, and to seal up the vision and prophecy, and to anoint the most Holy.\" (Daniel 9:24)\n\nThis verse is significant as it outlines God's plan for redemption and the coming of the Messiah, highlighting key themes of sin, reconciliation, and divine prophecy within"
    },
    {
        "Date": "Thu Jun 06",
        "Title": "Daniel 10",
        "Abbreviated": "Dan.10",
        "Xreference": "['Isa.35.4', 'Josh.1.9', 'Acts.10.30-Acts.10.31', 'Dan.10.19', 'Isa.58.9']",
        "Tags": "\"Fear not, Daniel, for from the first day that you set your heart to understand and humbled yourself before your God, your words have been heard, and I have come because of your words.\" (Daniel 10:12)\n\nThis verse highlights the importance of prayer and humility in seeking understanding from God, assuring believers that their cries are heard."
    },
    {
        "Date": "Fri Jun 07",
        "Title": "Daniel 11:1-13",
        "Abbreviated": "Dan.11",
        "Xreference": "['1Chr.28.9', 'Ps.9.10', 'John.17.3', 'Zech.10.12', 'Mic.5.7-Mic.5.9']",
        "Tags": "\"Also I, in the first year of Darius the Mede, stood up to confirm and strengthen him.\" (Daniel 11:1)\n\nThis verse is significant as it illustrates the role of angelic forces in supporting leaders during tumultuous times, indicating the spiritual dynamics at play in human affairs."
    },
    {
        "Date": "Sat Jun 08",
        "Title": "Daniel 11:14-28",
        "Abbreviated": "Dan.11",
        "Xreference": "['1Chr.28.9', 'Ps.9.10', 'John.17.3', 'Zech.10.12', 'Mic.5.7-Mic.5.9']",
        "Tags": "\"Also in those times many shall rise up against the king of the south; the violent men among your own people shall lift themselves up in order to fulfill the vision, but they shall fail.\" (Daniel 11:14)\n\nThis verse highlights the internal conflict and strife among the people of Israel, reflecting the political turbulence and struggles for power during this historical period, emphasizing the challenges they faced in fulfilling God's plans amidst chaos."
    },
    {
        "Date": "Sun Jun 09",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Jun 10",
        "Title": "Daniel 11:29-45",
        "Abbreviated": "Dan.11",
        "Xreference": "['1Chr.28.9', 'Ps.9.10', 'John.17.3', 'Zech.10.12', 'Mic.5.7-Mic.5.9']",
        "Tags": "\"At the time appointed he shall return and go toward the south; but it shall not be as it was before.\" (Daniel 11:29)\n\nThis verse highlights the pivotal moment in prophetic history, indicating a change in the power dynamics of the time and emphasizing the unfolding of God's plan through various historical events."
    },
    {
        "Date": "Tue Jun 11",
        "Title": "Daniel 12",
        "Abbreviated": "Dan.12",
        "Xreference": "['Matt.13.43', 'Prov.4.18', 'Isa.26.19', 'John.5.28-John.5.29', 'Jer.30.7']",
        "Tags": "\"The wise shall understand, but the wicked shall do wickedly; and none of the wicked shall understand, but the wise shall understand.\" (Daniel 12:10)\n\nThis verse highlights the distinction between the wise, who seek knowledge and understanding, and the wicked, who remain in ignorance, underscoring the importance of wisdom in the face of adversity."
    },
    {
        "Date": "Wed Jun 12",
        "Title": "Haggai 1",
        "Abbreviated": "Hag.1",
        "Xreference": "['Hag.1.9', '2Sam.7.2', 'Hos.4.10', 'Deut.28.38-Deut.28.40', 'Mal.3.9-Mal.3.11']",
        "Tags": "\"The time has not yet come to rebuild the house of the LORD.\" (Haggai 1:2)\n\nThis verse highlights the people's delay in prioritizing the rebuilding of the Temple, demonstrating their misplaced focus and prompting reflection on their commitment to God's work."
    },
    {
        "Date": "Thu Jun 13",
        "Title": "Haggai 2",
        "Abbreviated": "Hag.2",
        "Xreference": "['Ps.50.10-Ps.50.12', 'Hab.3.17-Hab.3.18', 'Mal.3.10', 'Ps.24.1', 'Prov.3.9-Prov.3.10']",
        "Tags": "\"The glory of this latter house shall be greater than of the former, saith the Lord of hosts: and in this place will I give peace, saith the Lord of hosts.\" (Haggai 2:9)\n\nThis verse emphasizes the promise of restored glory and greater spiritual significance to the newly rebuilt temple, highlighting God's presence and peace among His people."
    },
    {
        "Date": "Fri Jun 14",
        "Title": "Job 1",
        "Abbreviated": "Job.1",
        "Xreference": "['Jas.5.11', 'Isa.40.6-Isa.40.8', 'Job.8.9', 'Ezek.14.14', '1Pet.1.24']",
        "Tags": "\"Now there was a day when the sons of God came to present themselves before the Lord, and Satan also came among them.\" (Job 1:6)\n\nThis verse is significant because it introduces the cosmic conflict between good and evil, showcasing the role of Satan and setting the tone for the trials that Job is about to face."
    },
    {
        "Date": "Sat Jun 15",
        "Title": "Job 2 ",
        "Abbreviated": "Job.2.",
        "Xreference": "['Jas.1.12', 'Lam.3.38-Lam.3.41', 'Job.1.21-Job.1.22', 'Rom.12.12', 'Jas.5.10-Jas.5.11']",
        "Tags": "\"And the Lord said to Satan, 'Behold, he is in your hand; only spare his life.'\" (Job 2:6)\n\nThis verse is significant as it underscores the test that Job faces, highlighting themes of suffering, faith, and the nature of divine permission in the context of human trials."
    },
    {
        "Date": "Sun Jun 16",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Jun 17",
        "Title": "Job 3",
        "Abbreviated": "Job.3",
        "Xreference": "['Job.32.8', 'Jas.1.14-Jas.1.15', 'Gen.2.7', 'Matt.5.28-Matt.5.29', '1John.2.16']",
        "Tags": "\"Why is light given to those in misery, and life to the bitter of soul?\" (Job 3:20)\n\nThis verse captures Job's profound anguish and questions the purpose of suffering, reflecting the struggle to find meaning in pain."
    },
    {
        "Date": "Tue Jun 18",
        "Title": "Job 19",
        "Abbreviated": "Job.19",
        "Xreference": "['Eph.1.7', 'Isa.54.5', 'Ps.78.35', 'Prov.23.11', 'Ps.19.14']",
        "Tags": "\"I know that my redeemer lives, and at the last he will stand upon the earth.\" (Job 19:25)\n\nThis verse is significant as it expresses Job's unwavering faith in a future redemption and hope, despite his immense suffering."
    },
    {
        "Date": "Wed Jun 19",
        "Title": "Job 29",
        "Abbreviated": "Job.29",
        "Xreference": "['Isa.61.10', 'Isa.59.17']",
        "Tags": "\"Justice was mine; I delivered to the needy the cause which I knew not,\" (Job 29:12).\n\nThis verse highlights Job's commitment to righteousness and caring for the vulnerable, illustrating the deep sense of justice and moral responsibility he held during his prosperous days."
    },
    {
        "Date": "Thu Jun 20",
        "Title": "Job 30",
        "Abbreviated": "Job.30",
        "Xreference": "['Jer.8.15']",
        "Tags": "\"Now I am their song; I am a byword to them.\" (Job 30:9)\n\nThis verse highlights Job's deep sense of humiliation and despair, as he reflects on how his former status has been replaced by mockery and scorn among those he once esteemed."
    },
    {
        "Date": "Fri Jun 21",
        "Title": "Job 31",
        "Abbreviated": "Job.31",
        "Xreference": "['Jas.1.14-Jas.1.15', 'Matt.5.28-Matt.5.29', '1John.2.16', 'Ps.119.37', 'Prov.6.25']",
        "Tags": "“Job 31:1: I made a covenant with my eyes; why then should I look upon a young woman?”\n\nThis verse reflects Job's commitment to purity and integrity, highlighting the importance of personal boundaries and the choices we make in regard to temptation."
    },
    {
        "Date": "Sat Jun 22",
        "Title": "Psalm 102",
        "Abbreviated": "Ps.102",
        "Xreference": "['Gen.1.1', 'Isa.51.6', 'Isa.60.1', 'Gal.4.4', 'Matt.24.35']",
        "Tags": "\"Of old you laid the foundation of the earth, and the heavens are the work of your hands.\" (Psalm 102:25)\n\nThis verse emphasizes God's sovereignty and creative power, highlighting His eternal nature and the transient nature of the creation compared to Him."
    },
    {
        "Date": "Sun Jun 23",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Jun 24",
        "Title": "Job 38",
        "Abbreviated": "Job.38",
        "Xreference": "['Ps.104.5', 'Isa.40.12', 'Job.32.8', 'Luke.12.24']",
        "Tags": "\"Where were you when I laid the foundation of the earth? Tell me, if you have understanding.\" (Job 38:4)\n\nThis verse is significant because it underscores God's sovereignty and omniscience, highlighting the limitations of human understanding in contrast to divine wisdom in the context of creation."
    },
    {
        "Date": "Tue Jun 25",
        "Title": "Job 39",
        "Abbreviated": "Job.39",
        "Xreference": "[]",
        "Tags": "\"Do you know the mountain goats give birth? Do you watch when the doe bears her fawn?\" (Job 39:1)\n\nThis verse highlights God's intimate knowledge of the natural world, reflecting the theme of divine wisdom and the majesty of creation evident throughout the Book of Job."
    },
    {
        "Date": "Wed Jun 26",
        "Title": "Job 40",
        "Abbreviated": "Job.40",
        "Xreference": "[]",
        "Tags": "\"Shall a faultfinder contend with the Almighty? He who argues with God, let him answer it.\" (Job 40:2)\n\nThis verse underscores the theme of human limitations in understanding God's ways and the futility of questioning divine authority."
    },
    {
        "Date": "Thu Jun 27",
        "Title": "Job 41",
        "Abbreviated": "Job.41",
        "Xreference": "['Rom.11.35']",
        "Tags": "“Can you draw out Leviathan with a hook, or snare his tongue with a line which you lower?” (Job 41:1)\n\nThis verse highlights the unmatched power and majesty of God’s creation, specifically emphasizing the Leviathan as a symbol of chaos and the limitations of human strength in the face of divine authority."
    },
    {
        "Date": "Fri Jun 28",
        "Title": "Job 42",
        "Abbreviated": "Job.42",
        "Xreference": "['Matt.19.26', 'Mark.10.27', 'Gen.18.14', 'Deut.30.3', 'Heb.4.12-Heb.4.13']",
        "Tags": "\"Job answered the LORD: 'I know that you can do all things; no purpose of yours can be thwarted.'\" (Job 42:2)\n\nThis verse highlights Job's realization of God's supreme power and sovereignty, acknowledging that God's plans are ultimately unassailable and beyond human understanding."
    },
    {
        "Date": "Sat Jun 29",
        "Title": "1 Thessalonians 1",
        "Abbreviated": "1Thess.1",
        "Xreference": "['1Cor.13.13', '1Thess.5.9', 'Rev.2.19', 'Titus.2.7', '2Thess.2.13']",
        "Tags": "\"For we know, brothers and sisters loved by God, that he has chosen you.\" (1 Thessalonians 1:4)\n\nThis verse underscores the assurance of God's love and selection for believers, highlighting a central theme of faith and identity within the Christian community."
    },
    {
        "Date": "Sun Jun 30",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Jul 01",
        "Title": "1 Thessalonians 2",
        "Abbreviated": "1Thess.2",
        "Xreference": "['Heb.4.12', 'Rom.10.17', '1Pet.1.23', 'Gal.1.10', '1Pet.1.25']",
        "Tags": "\"For you yourselves know, brothers, that our coming to you was not in vain.\" (1 Thessalonians 2:1)\n\nThis verse underscores the genuine effort and intention of the Apostle Paul and his companions in their ministry, affirming the importance of their relationship with the Thessalonian believers."
    },
    {
        "Date": "Tue Jul 02",
        "Title": "1 Thessalonians 3",
        "Abbreviated": "1Thess.3",
        "Xreference": "['1Thess.5.23', 'Col.1.22', 'Acts.14.22', 'Phil.1.9', 'Rom.5.3']",
        "Tags": "\"Now may our God and Father himself, and our Lord Jesus, clear the way for us to come to you!\" (1 Thessalonians 3:11)\n\nThis verse highlights the importance of prayer and divine assistance in the context of building and maintaining relationships within the Christian community."
    },
    {
        "Date": "Wed Jul 03",
        "Title": "1 Thessalonians 4",
        "Abbreviated": "1Thess.4",
        "Xreference": "['1Cor.15.51-1Cor.15.52', '1Cor.15.52', 'Rev.1.7', 'Matt.24.30-Matt.24.31', '1Pet.4.2']",
        "Tags": "\"For the Lord himself will descend from heaven with a cry of command, with the voice of an archangel, and with the sound of the trumpet of God. And the dead in Christ will rise first.\" (1 Thessalonians 4:16)\n\nThis verse is significant because it assures believers of the return of Christ and the resurrection of the dead, providing hope and encouragement regarding eternal life for followers of Jesus."
    },
    {
        "Date": "Thu Jul 04",
        "Title": "1 Thessalonians 5",
        "Abbreviated": "1Thess.5",
        "Xreference": "['Eph.5.20', 'Rom.12.12', 'Col.4.2', 'Phil.4.6', 'Eph.6.18']",
        "Tags": "\"Rejoice always, pray without ceasing, give thanks in all circumstances; for this is the will of God in Christ Jesus for you.\" (1 Thessalonians 5:16-18)\n\nThis passage is significant as it encapsulates key aspects of Christian life: maintaining joy, constant prayer, and gratitude, which are essential for spiritual well-being despite life's challenges."
    },
    {
        "Date": "Fri Jul 05",
        "Title": "2 Thessalonians 1",
        "Abbreviated": "2Thess.1",
        "Xreference": "['Matt.25.41', '1Pet.4.17', 'Phil.2.13', '2Pet.3.18', 'Col.3.25']",
        "Tags": "\"To this end we always pray for you, that our God may make you worthy of his calling and may fulfill every resolve for good and every work of faith by his power.\" (2 Thessalonians 1:11)\n\nThis verse highlights the apostles' commitment to prayer and their desire for the Thessalonians to be empowered by God in their Christian walk, emphasizing the connection between faith, works, and divine assistance."
    },
    {
        "Date": "Sat Jul 06",
        "Title": "2 Thessalonians 2",
        "Abbreviated": "2Thess.2",
        "Xreference": "['Matt.24.4-Matt.24.6', '1Tim.4.1-1Tim.4.3', 'Eph.5.6', 'Dan.7.25', '1John.2.18']",
        "Tags": "\"Let no one deceive you in any way. For that day will not come, unless the rebellion comes first, and the man of lawlessness is revealed, the son of destruction.\" (2 Thessalonians 2:3)\n\nThis verse is significant as it warns believers against deception regarding the return of Christ, highlighting the importance of discernment in the face of end-time events."
    },
    {
        "Date": "Sun Jul 07",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Jul 08",
        "Title": "2 Thessalonians 3",
        "Abbreviated": "2Thess.3",
        "Xreference": "['2Tim.4.18', '1Thess.5.24', '1Cor.10.13', 'Ps.121.7', '1Cor.1.9']",
        "Tags": "\"And if anyone does not obey our instruction in this letter, take note of that person and do not associate with him, so that he may be ashamed.\" (2 Thessalonians 3:14)\n\nThis verse underscores the importance of discipline within the church community, highlighting the need for adherence to apostolic teachings and the possibility of bringing a wayward individual to repentance through social separation."
    },
    {
        "Date": "Tue Jul 09",
        "Title": "Jude 1:1-11",
        "Abbreviated": "Jude.1",
        "Xreference": "['Eph.6.18', 'Rom.8.26-Rom.8.27', '1Cor.14.15', '2Tim.4.18', 'Eph.3.20']",
        "Tags": "\"Yet in the same way these dreamers also defile the flesh, reject authority, and blaspheme the glorious ones.\" (Jude 1:8)\n\nThis verse highlights the danger of false teachers who undermine moral standards and authority, serving as a warning to the early church about the consequences of straying from true faith."
    },
    {
        "Date": "Wed Jul 10",
        "Title": "Jude 1:12-25",
        "Abbreviated": "Jude.1",
        "Xreference": "['Eph.6.18', 'Rom.8.26-Rom.8.27', '1Cor.14.15', '2Tim.4.18', 'Eph.3.20']",
        "Tags": "\"These are blemishes on your love feasts, eating with you without the slightest qualm—shepherds who feed only themselves. They are clouds without rain, blown along by the wind; autumn trees, without fruit and uprooted—twice dead.\" (Jude 1:12)\n\nThis verse highlights the dangers of false leaders within the church who appear to provide nourishment but ultimately fail to support and guide their community."
    },
    {
        "Date": "Thu Jul 11",
        "Title": "1 Chronicles 5",
        "Abbreviated": "1Chr.5",
        "Xreference": "['Ps.22.4-Ps.22.5', 'Ps.9.10', '2Chr.18.31', 'Ps.20.7-Ps.20.8', 'Josh.10.14']",
        "Tags": "\"Now the sons of Reuben the firstborn of Israel (for he was the firstborn, but when he defiled his father's bed, his birthright was given to the sons of Joseph the son of Israel, and he is not to be enrolled in the genealogy as the firstborn).\" (1 Chronicles 5:1)\n\nThis verse highlights the theme of birthright and lineage, illustrating how Reuben's actions affected his status and the distribution of blessings among the tribes of Israel."
    },
    {
        "Date": "Fri Jul 12",
        "Title": "1 Chronicles 6",
        "Abbreviated": "1Chr.6",
        "Xreference": "[]",
        "Tags": "\"All the men of the second rank were Adnah the commander, and with him, 300,000 mighty men of valor.\" (1 Chronicles 12:27)\n\nThis verse highlights the strength and capability of David's military ranks, emphasizing the importance of leadership and valor in securing the kingdom of Israel."
    },
    {
        "Date": "Sat Jul 13",
        "Title": "Psalm 74",
        "Abbreviated": "Ps.74",
        "Xreference": "['Deut.32.8']",
        "Tags": "\"Yet God is my King from old, working salvation in the midst of the earth.\" (Psalm 74:12)\n\nThis verse highlights God's enduring sovereignty and His active role in providing salvation, even amidst times of turmoil and despair."
    },
    {
        "Date": "Sun Jul 14",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Jul 15",
        "Title": "1 Chronicles 9:1-21",
        "Abbreviated": "1Chr.9",
        "Xreference": "[]",
        "Tags": "\"All Israel was registered in the genealogies recorded in the Book of the Kings of Israel; and Judah was exiled to Babylon because of their unfaithfulness.\" (1 Chronicles 9:1)\n\nThis verse highlights the theme of accountability and the consequences of unfaithfulness, serving as a reminder of the importance of faithfulness within the community of Israel."
    },
    {
        "Date": "Tue Jul 16",
        "Title": "1 Chronicles 9:22-44",
        "Abbreviated": "1Chr.9",
        "Xreference": "[]",
        "Tags": "In 1 Chronicles 9:22-44, a significant verse is \"All these were in the genealogies, listed by name in their villages.\" \n\nThis verse highlights the importance of lineage and community identity among the Israelites, emphasizing their history and connection to their ancestors."
    },
    {
        "Date": "Wed Jul 17",
        "Title": "1 Chronicles 10",
        "Abbreviated": "1Chr.10",
        "Xreference": "['Lev.20.6', 'Lev.19.31', '1Sam.15.23']",
        "Tags": "\"The death of Saul and his sons, and the battle that took place at Gilboa.\" (1 Chronicles 10:1)\n\nThis verse marks a pivotal moment in Israel's history, underscoring the tragic end of King Saul's reign and the beginning of a new era under David's leadership."
    },
    {
        "Date": "Thu Jul 18",
        "Title": "1 Chronicles 11:1-25",
        "Abbreviated": "1Chr.11",
        "Xreference": "[]",
        "Tags": "\"Then all Israel gathered together to David at Hebron and said, 'Behold, we are your bone and flesh.'\" (1 Chronicles 11:1)\n\nThis verse highlights the unity and recognition of David's kinship with the people of Israel, marking the beginning of his reign as king and the consolidation of Israel under his leadership."
    },
    {
        "Date": "Fri Jul 19",
        "Title": "1 Chronicles 13",
        "Abbreviated": "1Chr.13",
        "Xreference": "[]",
        "Tags": "\"Then David consulted with the commanders of thousands and of hundreds, with every leader.\" (1 Chronicles 13:1)\n\nThis verse highlights the importance of seeking counsel and collaboration in leadership, demonstrating David's desire to include his leaders in the decision-making process regarding the transportation of the Ark of the Covenant."
    },
    {
        "Date": "Sat Jul 20",
        "Title": "1 Chronicles 14",
        "Abbreviated": "1Chr.14",
        "Xreference": "[]",
        "Tags": "\"Then David enquired of God, 'Shall I go up against the Philistines? And will You deliver them into my hand?' The Lord said to him, 'Go up, for I will deliver them into your hand.'\" (1 Chronicles 14:10)\n\nThis verse highlights the importance of seeking divine guidance and assurance before taking action, illustrating David's reliance on God for victory in battle."
    },
    {
        "Date": "Sun Jul 21",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Jul 22",
        "Title": "1 Chronicles 15",
        "Abbreviated": "1Chr.15",
        "Xreference": "['2Sam.6.3']",
        "Tags": "\"Thus all Israel brought up the ark of the covenant of the LORD with shouting, and with sound of the horn, with trumpets, and with cymbals, making a joyful noise before the LORD.\" (1 Chronicles 15:28)\n\nThis verse highlights the celebration and reverence associated with bringing the Ark of the Covenant to Jerusalem, emphasizing the importance of worship and community joy in honoring God."
    },
    {
        "Date": "Tue, Jul 23",
        "Title": "1 Chronicles 16:1-22",
        "Abbreviated": "1Chr.16",
        "Xreference": "['Ps.27.8-Ps.27.9', 'Zeph.2.2-Zeph.2.3', 'Ps.68.35', 'Ps.105.1-Ps.105.15', 'Ps.106.1']",
        "Tags": "\"Give thanks to the LORD, for he is good; his love endures forever.\" (1 Chronicles 16:34)\n\nThis verse highlights the importance of gratitude and the enduring nature of God's love, serving as a central theme of worship and praise in the context of the Israelites' celebration of God's faithfulness."
    },
    {
        "Date": "Wed, Jul 24",
        "Title": "1 Chronicles 16:23-43",
        "Abbreviated": "1Chr.16",
        "Xreference": "['Ps.27.8-Ps.27.9', 'Zeph.2.2-Zeph.2.3', 'Ps.68.35', 'Ps.105.1-Ps.105.15', 'Ps.106.1']",
        "Tags": "\"Sing to the Lord, all the earth! Tell of his salvation from day to day.\" (1 Chronicles 16:23)\n\nThis verse highlights the importance of worship and spreading the message of God's salvation, emphasizing a continuous, communal celebration of faith."
    },
    {
        "Date": "Thu, Jul 25",
        "Title": "1 Chronicles 17",
        "Abbreviated": "1Chr.17",
        "Xreference": "[]",
        "Tags": "\"In all my thoughts, I have been with you.\" (1 Chronicles 17:2)\n\nThis verse is significant as it highlights God's intimate relationship with David, affirming that God is deeply involved in the thoughts and plans of His chosen leaders."
    },
    {
        "Date": "Fri, Jul 26",
        "Title": "1 Chronicles 21",
        "Abbreviated": "1Chr.21",
        "Xreference": "['2Sam.24.1-2Sam.24.25']",
        "Tags": "\"Then David said to God, 'I have sinned greatly in what I have done. But now, I pray, take away the iniquity of Your servant, for I have done very foolishly.'\" (1 Chronicles 21:8)\n\nThis verse is significant as it reflects David's acknowledgment of his sin and his heartfelt repentance, highlighting the importance of humility and seeking God's mercy."
    },
    {
        "Date": "Sat, Jul 27",
        "Title": "1 Chronicles 22",
        "Abbreviated": "1Chr.22",
        "Xreference": "['1Chr.28.9']",
        "Tags": "\"Be strong and courageous, and do it; do not be afraid and do not be dismayed, for the Lord God, even my God, is with you.\" (1 Chronicles 22:13)\n\nThis verse emphasizes the importance of strength and courage in fulfilling God's plans, reassured by His presence and support in our endeavors."
    },
    {
        "Date": "Sun, Jul 28",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon, Jul 29",
        "Title": "1 Chronicles 28",
        "Abbreviated": "1Chr.28",
        "Xreference": "['Jer.29.13', 'Jas.4.8-Jas.4.11', 'Matt.7.7-Matt.7.8', 'Isa.55.6-Isa.55.7', 'Jer.24.7']",
        "Tags": "\"Now set your mind and heart to seek the Lord your God.\" (1 Chronicles 28:9)\n\nThis verse highlights the importance of dedicating one's focus and intention toward seeking a relationship with God, which is fundamental for spiritual leadership and commitment."
    },
    {
        "Date": "Tue, Jul 30",
        "Title": "1 Chronicles 29",
        "Abbreviated": "1Chr.29",
        "Xreference": "['Heb.1.3', 'Dan.4.34-Dan.4.35', '1Tim.1.17', 'Rev.5.12-Rev.5.13', 'Jude.1.25']",
        "Tags": "\"Yours, O LORD, is the greatness and the power and the glory and the victory and the majesty, for all that is in heaven and in the earth is Yours; Yours is the kingdom, O LORD, and You are exalted as head over all.\" (1 Chronicles 29:11)\n\nThis verse highlights the sovereignty of God, acknowledging His supreme authority and the ultimate ownership of all creation, making it a profound declaration of worship and reverence."
    },
    {
        "Date": "Wed, Jul 31",
        "Title": "Psalm 104",
        "Abbreviated": "Ps.104",
        "Xreference": "['Hab.3.17-Hab.3.18', 'Heb.1.7', 'Job.33.4', 'Ps.1.2', 'Phil.4.4']",
        "Tags": "\"He makes grass grow for the cattle, and plants for people to cultivate—bringing forth food from the earth.\" (Psalm 104:14)\n\nThis verse highlights God's provision for all living creatures, illustrating the interconnectedness of nature and the care He takes in sustaining life."
    },
    {
        "Date": "Thu, Aug 1",
        "Title": "2 Chronicles 1",
        "Abbreviated": "2Chr.1",
        "Xreference": "['1Pet.3.12', 'Prov.15.3', 'Jer.16.17', 'Prov.5.21', 'Ps.34.15']",
        "Tags": "\"Ask what I shall give you.\" (2 Chronicles 1:7)\n\nThis verse is significant as it highlights God's willingness to grant Solomon anything he desires, setting the stage for Solomon's wisdom to reign over Israel."
    },
    {
        "Date": "Fri, Aug 2",
        "Title": "2 Chronicles 6:1-21",
        "Abbreviated": "2Chr.6",
        "Xreference": "[]",
        "Tags": "\"Then Solomon said, ‘The Lord has said that he would dwell in thick darkness.’\" (2 Chronicles 6:1)\n\nThis verse highlights the transcendence of God and the mystery of His presence, underscoring Solomon's acknowledgment of God's greatness as he dedicates the temple."
    },
    {
        "Date": "Sat, Aug 3",
        "Title": "2 Chronicles 6:22-42",
        "Abbreviated": "2Chr.6",
        "Xreference": "[]",
        "Tags": "\"Then hear from heaven their prayer and their pleas, and uphold their cause.\" (2 Chronicles 6:35)\n\nThis verse highlights the importance of God’s response to the prayers of His people, emphasizing His role as a listener and as someone who upholds justice and righteousness."
    },
    {
        "Date": "Sun, Aug 4",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"For an overseer, as God's steward, must be above reproach. He must not be arrogant or quick-tempered or a drunkard or violent or greedy for gain.\" (Titus 1:7)\n\nThis verse is significant as it establishes the essential qualities and moral standards required for church leaders, emphasizing integrity and self-control in their responsibilities."
    },
    {
        "Date": "Mon, Aug 5",
        "Title": "2 Chronicles 7",
        "Abbreviated": "2Chr.7",
        "Xreference": "['Jas.4.9-Jas.4.10', 'Lam.3.40-Lam.3.41', 'Isa.55.6-Isa.55.7', 'Prov.28.13', '2Chr.6.37-2Chr.6.39']",
        "Tags": "\"If my people, who are called by my name, humble themselves, and pray and seek my face and turn from their wicked ways, then I will hear from heaven and will forgive their sin and heal their land.\" (2 Chronicles 7:14)\n\nThis verse highlights the importance of humility, prayer, and repentance among God's people, emphasizing the promise of divine forgiveness and restoration."
    },
    {
        "Date": "Tue, Aug 6",
        "Title": "2 Chronicles 8",
        "Abbreviated": "2Chr.8",
        "Xreference": "[]",
        "Tags": "\"Solomon brought in the things which his father David had dedicated, the silver and the gold and all the furnishings, and he stored them in the treasuries of the house of God.\" (2 Chronicles 8:11)\n\nThis verse highlights Solomon's commitment to honoring the legacy of his father, David, and the importance of dedicating resources to the worship and service of God."
    },
    {
        "Date": "Wed, Aug 7",
        "Title": "2 Chronicles 9",
        "Abbreviated": "2Chr.9",
        "Xreference": "[]",
        "Tags": "\"The king made silver and gold as plentiful in Jerusalem as stones, and he made cedar as abundant as the sycamores of the Shephelah.\" (2 Chronicles 9:27)\n\nThis verse highlights the immense wealth and prosperity that King Solomon brought to Jerusalem, symbolizing the height of Israel's glory and the fulfillment of God's promises during his reign."
    },
    {
        "Date": "Thu, Aug 8",
        "Title": "2 Chronicles 10",
        "Abbreviated": "2Chr.10",
        "Xreference": "[]",
        "Tags": "\"Then King Rehoboam took counsel with the old men who had stood before Solomon his father while he was yet alive, saying, 'What should I answer this people?'\" (2 Chronicles 10:6)\n\nThis verse highlights the pivotal moment when Rehoboam seeks advice from the elders, ultimately influencing his decision-making and the future of his reign."
    },
    {
        "Date": "Fri, Aug 9",
        "Title": "2 Chronicles 11",
        "Abbreviated": "2Chr.11",
        "Xreference": "[]",
        "Tags": "\"Rehoboam established himself in Jerusalem and continued as king.\" (2 Chronicles 11:17)\n\nThis verse is significant as it marks the consolidation of Rehoboam's reign and the establishment of his rule in Judah, providing a foundational moment in the history of the divided monarchy in Israel."
    },
    {
        "Date": "Sat, Aug 10",
        "Title": "Psalm 21",
        "Abbreviated": "Ps.21",
        "Xreference": "['Ps.10.2', 'Ps.2.1', 'Matt.2.2', 'Ps.62.7', 'Heb.12.2']",
        "Tags": "\"The king rejoices in your strength, O Lord, and how great is his joy in the victories you give.\" (Psalm 21:1)\n\nThis verse highlights the profound connection between divine strength and human triumph, illustrating how the king's joy is rooted in God's empowerment and victories."
    },
    {
        "Date": "Sun, Aug 11",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon, Aug 12",
        "Title": "2 Chronicles 15",
        "Abbreviated": "2Chr.15",
        "Xreference": "['1Cor.15.58', 'Josh.1.7', 'Josh.1.9', 'Heb.10.35', 'Jas.4.8']",
        "Tags": "\"but you, take courage! Do not let your hands be weak, for your work shall be rewarded.\" (2 Chronicles 15:7)\n\nThis verse is significant as it encourages perseverance and courage, assuring that diligent efforts in serving God will ultimately lead to rewards."
    },
    {
        "Date": "Tue, Aug 13",
        "Title": "2 Chronicles 16",
        "Abbreviated": "2Chr.16",
        "Xreference": "['1Pet.3.12', 'Prov.15.3', 'Jer.16.17', 'Prov.5.21', 'Ps.34.15']",
        "Tags": "\"Because you relied on the king of Aram and not on the Lord your God, the army of the king of Aram has escaped from your hand.\" (2 Chronicles 16:7)\n\nThis verse highlights King Asa's failure to trust in God for deliverance, illustrating the consequences of placing faith in human alliances over divine assistance."
    },
    {
        "Date": "Wed, Aug 14",
        "Title": "2 Chronicles 20",
        "Abbreviated": "2Chr.20",
        "Xreference": "['Exod.14.13-Exod.14.14', '2Chr.32.7-2Chr.32.8', 'Deut.31.6', 'Exod.14.13-Exod.14.14', 'Deut.31.8']",
        "Tags": "\"Jehoshaphat stood in the assembly of Judah and Jerusalem, in the house of the Lord, before the new court, and said: 'O Lord God of our fathers, are You not God in heaven, and do You not rule over all the kingdoms of the nations?'\" (2 Chronicles 20:5-6)\n\nThis verse is significant as it highlights King Jehoshaphat's acknowledgment of God's sovereignty and power, setting the stage for the united prayer and seeking of divine"
    },
    {
        "Date": "Thu, Aug 15",
        "Title": "2 Chronicles 21",
        "Abbreviated": "2Chr.21",
        "Xreference": "[]",
        "Tags": "\"Nevertheless, because of the sin of Jehoram the Lord was provoked to anger against Judah and Jerusalem.\" (2 Chronicles 21:16)\n\nThis verse highlights the consequences of Jehoram's sinful actions, illustrating how individual and collective disobedience can lead to divine judgment and strife within a nation."
    },
    {
        "Date": "Fri, Aug 16",
        "Title": "2 Chronicle 22",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"Now when Athaliah the mother of Ahaziah saw that her son was dead, she arose and destroyed all the royal offspring.\" (2 Chronicles 22:10)\n\nThis verse is significant as it marks a pivotal moment of political violence and intrigue in Judah, highlighting the ruthless actions of Athaliah in her quest for power."
    },
    {
        "Date": "Sat, Aug 17",
        "Title": "2 Chronicles 29",
        "Abbreviated": "2Chr.29",
        "Xreference": "[]",
        "Tags": "\"Then Hezekiah the king rose early, gathered the rulers of the city, and went up to the house of the Lord.\" (2 Chronicles 29:20)\n\nThis verse is significant as it highlights King Hezekiah's commitment to restoring worship in the Temple, marking a pivotal moment in the religious renewal of Judah."
    },
    {
        "Date": "Sun, Aug 18",
        "Title": "SIMPLE CHURCH RALLY",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon, Aug 19",
        "Title": "2 Chronicles 30",
        "Abbreviated": "2Chr.30",
        "Xreference": "[]",
        "Tags": "\"Then Hezekiah sent to all Israel and Judah and wrote letters to Ephraim and Manasseh, that they should come to the house of the LORD at Jerusalem to keep the Passover to the LORD God of Israel.\" (2 Chronicles 30:1)\n\nThis verse is significant because it marks King Hezekiah's efforts to unite the divided kingdom of Israel and Judah in worship and restoration of the Passover, highlighting themes of repentance and communal revival."
    },
    {
        "Date": "Tue, Aug 20",
        "Title": "2 Chronicles 31",
        "Abbreviated": "2Chr.31",
        "Xreference": "['Matt.6.33', 'Jer.29.13', 'Josh.1.7-Josh.1.8']",
        "Tags": "\"Moreover, he commanded the people who lived in Jerusalem to give the portion due to the priests and the Levites, that they might give themselves to the law of the Lord.\" (2 Chronicles 31:4)\n\nThis verse highlights King Hezekiah's commitment to restore proper worship and support for the priests and Levites, ensuring that they could dedicate themselves fully to God's service."
    },
    {
        "Date": "Wed, Aug 21",
        "Title": "2 Chronicles 34",
        "Abbreviated": "2Chr.34",
        "Xreference": "['2Chr.32.26']",
        "Tags": "\"Go and inquire of the LORD for me and for those who are left in Israel and in Judah, concerning the words of the book that has been found; for great is the wrath of the LORD that is poured out on us because our fathers have not kept the word of the LORD, to do according to all that is written in this book.\" (2 Chronicles 34:21)\n\nThis verse highlights King Josiah's urgency to seek God's guidance in response to the discovery of the Book of the"
    },
    {
        "Date": "Thu, Aug 22",
        "Title": "Habakkuk 1",
        "Abbreviated": "Hab.1",
        "Xreference": "['Acts.13.40-Acts.13.41', 'Ps.5.4-Ps.5.5', 'Ps.34.15-Ps.34.16']",
        "Tags": "\"How long, O Lord, will I call for help, and you will not hear? I cry out to you 'Violence!' and you will not save.\" (Habakkuk 1:2)\n\nThis verse captures Habakkuk's profound frustration and anguish over the injustice and violence he sees in his society, setting the stage for a dialogue about faith and divine justice."
    },
    {
        "Date": "Fri, Aug 23",
        "Title": "Habakkuk 2",
        "Abbreviated": "Hab.2",
        "Xreference": "['Rom.1.17', 'Ps.27.14', 'Heb.10.38', 'Heb.10.36-Heb.10.37', 'Ezek.12.25']",
        "Tags": "\"Behold, his soul is puffed up; it is not upright within him, but the righteous shall live by his faith.\" (Habakkuk 2:4)\n\nThis verse encapsulates a vital theme in Habakkuk, contrasting pride and unrighteousness with the righteous commitment to faith, highlighting the importance of faith in the face of injustice."
    },
    {
        "Date": "Sat, Aug 24",
        "Title": "Habakkuk 3",
        "Abbreviated": "Hab.3",
        "Xreference": "['2Sam.22.34', 'Job.13.15', 'Ps.85.6', 'Ps.18.33', 'Phil.4.4']",
        "Tags": "\"Yet I will rejoice in the Lord; I will take joy in the God of my salvation.\" (Habakkuk 3:18)\n\nThis verse highlights Habakkuk's unwavering faith and joy in God despite difficult circumstances, illustrating the theme of trust and hope amidst adversity."
    },
    {
        "Date": "Sun, Aug 25",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon, Aug 26",
        "Title": "Malachai 1",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"The great King says, 'I have loved you,' says the Lord. But you ask, 'How have you loved us?'\" (Malachi 1:2)\n\nThis verse is significant as it reveals God's unwavering love for His people and sets the stage for a deeper exploration of their doubts and the consequences of their actions."
    },
    {
        "Date": "Tue, Aug 27",
        "Title": "Malachai 2",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"Have we not all one Father? Has not one God created us? Why then are we faithless to one another, profaning the covenant of our fathers?\" (Malachi 2:10)\n\nThis verse emphasizes the unity of humanity under one God and highlights the importance of faithfulness and integrity in relationships, particularly in the context of the covenant community."
    },
    {
        "Date": "Wed, Aug 28",
        "Title": "Malachi 3",
        "Abbreviated": "Mal.3",
        "Xreference": "['2Cor.9.6-2Cor.9.8', 'Matt.6.33', 'Num.23.19', 'Prov.3.9-Prov.3.10', 'Heb.13.8']",
        "Tags": "\"Bring the full tithe into the storehouse, that there may be food in my house. And thereby put me to the test, says the Lord of hosts, if I will not open the windows of heaven for you and pour down for you a blessing until there is no more need.\" (Malachi 3:10)\n\nThis verse highlights the importance of tithing and God's promise of abundant blessings in response to faithfulness in giving."
    },
    {
        "Date": "Thu, Aug 29",
        "Title": "Malachi 4",
        "Abbreviated": "Mal.4",
        "Xreference": "['Jer.33.6', 'Ps.84.11', 'Luke.1.16-Luke.1.17', 'Isa.30.26', 'Luke.1.17']",
        "Tags": "\"Behold, I will send you Elijah the prophet before the great and awesome day of the LORD comes.\" (Malachi 4:5)\n\nThis verse is significant because it prophetically announces the coming of Elijah before the Day of the Lord, signifying a pivotal moment of renewal and preparation for God's final redemptive act."
    },
    {
        "Date": "Fri, Aug 30",
        "Title": "Philemon",
        "Abbreviated": "Phlm",
        "Xreference": "['2Cor.7.13']",
        "Tags": "\"I appeal to you for my son Onesimus, who became my son while I was in chains.\" (Philemon 1:10)\n\nThis verse highlights the transformative power of Christian fellowship and the personal relationship that Paul develops with Onesimus, reflecting themes of forgiveness and reconciliation."
    },
    {
        "Date": "Sat, Aug 31",
        "Title": "Psalm 91",
        "Abbreviated": "Ps.91",
        "Xreference": "['Ps.32.7', 'Ps.27.5', 'Ps.36.7', 'Ps.17.8', '1John.4.15-1John.4.16']",
        "Tags": "\"He will cover you with his feathers, and under his wings you will find refuge; his faithfulness will be your shield and rampart.\" (Psalm 91:4)\n\nThis verse highlights the protective nature of God, using the imagery of a bird sheltering its young to illustrate the safety and comfort found in His presence."
    },
    {
        "Date": "Sun Sep 1",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Sep 2",
        "Title": "Joshua 1",
        "Abbreviated": "Josh.1",
        "Xreference": "['Gen.28.15', 'Ps.119.15', 'Jer.1.7-Jer.1.8', 'Ps.19.14', 'Josh.1.6-Josh.1.7']",
        "Tags": "\"Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.\" (Joshua 1:9)\n\nThis verse is significant as it provides a powerful encouragement to trust in God's presence and strength in facing challenges, reinforcing the themes of faith and leadership in the book of Joshua."
    },
    {
        "Date": "Tue Sep 3",
        "Title": "Joshua 2",
        "Abbreviated": "Josh.2",
        "Xreference": "['Deut.32.30', 'Lev.26.8', 'Deut.3.22', 'Exod.14.14', 'Ps.35.1']",
        "Tags": "\"She said, 'I know that the Lord has given you the land and that the terror of you has fallen on us, and that all the inhabitants of the land melt away before you.'\" (Joshua 2:9)\n\nThis verse highlights Rahab’s acknowledgment of God’s power and the fear He instilled in the people of Jericho, underscoring the faith that played a crucial role in Israel's conquest of the Promised Land."
    },
    {
        "Date": "Wed Sep 4",
        "Title": "Joshua 6",
        "Abbreviated": "Josh.6",
        "Xreference": "['1Kgs.16.34', 'Heb.11.30', '2Cor.10.4-2Cor.10.5', 'Deut.7.24', '1John.5.21']",
        "Tags": "\"Then the LORD said to Joshua, 'See, I have delivered Jericho into your hands, along with its king and its fighting men.'\" (Joshua 6:2)\n\nThis verse highlights God's promise and assurance of victory to Joshua, emphasizing the power of divine intervention in fulfilling His plans."
    },
    {
        "Date": "Thu Sep 5",
        "Title": "Joshua 8",
        "Abbreviated": "Josh.8",
        "Xreference": "[]",
        "Tags": "\"And the Lord said to Joshua, 'Do not fear and do not be dismayed; take all the fighting men with you, and arise, go up to Ai. See, I have given into your hand the king of Ai, and his people, his city, and his land.'\" (Joshua 8:1)\n\nThis verse is significant as it highlights God's assurance and support for Joshua and the Israelites as they prepare to reclaim Ai, underscoring the themes of faith and divine guidance in"
    },
    {
        "Date": "Fri Sep 6",
        "Title": "Joshua 9",
        "Abbreviated": "Josh.9",
        "Xreference": "['Prov.3.5-Prov.3.6']",
        "Tags": "\"Now therefore, make a covenant with us.\" (Joshua 9:6)\n\nThis verse signifies the beginning of a pivotal moment where the Gibeonites deceive Israel into making a treaty, illustrating themes of trust, deception, and the consequences of hasty decisions."
    },
    {
        "Date": "Sat Sep 7",
        "Title": "Psalm 37",
        "Abbreviated": "Ps.37",
        "Xreference": "['John.15.7', 'Ps.145.19', 'Isa.58.14', 'John.15.16', '1John.5.14-1John.5.15']",
        "Tags": "\"The steps of a man are established by the Lord, when he delights in his way.\" (Psalm 37:23)\n\nThis verse highlights the idea that a person's journey is guided by God when they find joy and purpose in following His path, emphasizing the importance of faith and trust in divine guidance."
    },
    {
        "Date": "Sun Sep 8",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Sep 9",
        "Title": "Joshua 10:1-15",
        "Abbreviated": "Josh.10",
        "Xreference": "['Hab.3.11']",
        "Tags": "\"And the sun stood still, and the moon stopped, until the nation took vengeance on their enemies.\" (Joshua 10:13)\n\nThis verse is significant because it illustrates God's power and His direct intervention in the battle, showcasing His commitment to Israel and the miraculous nature of their victory."
    },
    {
        "Date": "Tue Sep 10",
        "Title": "Joshua 10:16-43",
        "Abbreviated": "Josh.10",
        "Xreference": "['Hab.3.11']",
        "Tags": "\"Then the five kings of the Amorites, the kings of Jerusalem, Hebron, Jarmuth, Lachish, and Eglon, fled and hid in the cave at Makkedah.\" (Joshua 10:16)\n\nThis verse highlights a pivotal moment in the Israelite conquest of Canaan, showing the fate of the opposing kings and setting the stage for God's deliverance and victory for His people."
    },
    {
        "Date": "Wed Sep 11",
        "Title": "Joshua 11",
        "Abbreviated": "Josh.11",
        "Xreference": "[]",
        "Tags": "\"Then Joshua came at that time and cut off the Anakim from the mountains, from Hebron, from Debir, from Anab, and from all the mountains of Judah, and from all the mountains of Israel; Joshua utterly destroyed them with their cities.\" (Joshua 11:21)\n\nThis verse is significant as it marks a decisive victory over formidable enemies, emphasizing God's power and the fulfillment of His promise to Israel in granting them the land."
    },
    {
        "Date": "Thu Sep 12",
        "Title": "Joshua 12",
        "Abbreviated": "Josh.12",
        "Xreference": "[]",
        "Tags": "The most significant verse from Joshua 12 is \"These are the kings of the land whom the people of Israel defeated and took possession of their land.\" \n\nThis verse highlights the fulfillment of God's promises to the Israelites regarding their conquest and possession of the Promised Land, underscoring the theme of divine victory and the establishment of Israelite territory."
    },
    {
        "Date": "Fri Sep 13",
        "Title": "Joshua 20",
        "Abbreviated": "Josh.20",
        "Xreference": "[]",
        "Tags": "\"The cities which you shall give to the Levites shall be the six cities of refuge, which you shall provide for the manslayer that he may flee there.\" (Joshua 20:2)\n\nThis verse highlights the establishment of cities of refuge, demonstrating God's provision for mercy and justice in the Israelite community, allowing those who accidentally caused harm a chance for safety and a fair trial."
    },
    {
        "Date": "Sat Sep 14",
        "Title": "Psalm 131",
        "Abbreviated": "Ps.131",
        "Xreference": "['Rom.12.16', '1Cor.14.20', 'Ps.139.6', 'Mark.10.15', 'Job.42.3']",
        "Tags": "\"Surely I have calmed and quieted my soul, like a weaned child with its mother; like a weaned child is my soul within me.\" (Psalm 131:2)\n\nThis verse illustrates the theme of humility and trust in God, depicting a state of inner peace achieved through relinquishing pride and dependence, akin to a child finding comfort with its mother."
    },
    {
        "Date": "Sun Sep 15",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Sep 16",
        "Title": "Joshua 21",
        "Abbreviated": "Josh.21",
        "Xreference": "['1Kgs.8.56', 'Num.23.19', 'Josh.23.14-Josh.23.15', '1Thess.5.24', '1Cor.1.9']",
        "Tags": "\"The cities of refuge were for the children of Israel, and for the stranger and for the sojourner among them, that whoever kills a person accidentally may flee there.\" (Joshua 21:13)\n\nThis verse highlights the provision of cities of refuge as a means of justice and mercy, allowing individuals who commit unintentional manslaughter the opportunity for protection and fair trial."
    },
    {
        "Date": "Tue Sep 17",
        "Title": "Joshua 24",
        "Abbreviated": "Josh.24",
        "Xreference": "['1Kgs.18.21', 'John.6.67-John.6.68', 'Ruth.1.15-Ruth.1.16', 'Deut.29.18', 'Ezek.20.39']",
        "Tags": "\"Choose this day whom you will serve.\" (Joshua 24:15)\n\nThis verse emphasizes the importance of making a conscious and decisive choice regarding one's faith and allegiance, highlighting the central theme of commitment to God."
    },
    {
        "Date": "Wed Sep 18",
        "Title": "James 1:1-8",
        "Abbreviated": "Jas.1",
        "Xreference": "['1Pet.1.6-1Pet.1.8', 'Prov.17.27', 'Jas.1.12', 'John.3.27', 'Rom.2.13']",
        "Tags": "\"If any of you lacks wisdom, let him ask of God, who gives generously to all without reproach, and it will be given to him.\" (James 1:5)\n\nThis verse highlights the importance of seeking divine guidance and assures believers that God is willing to generously provide wisdom to those who earnestly ask for it."
    },
    {
        "Date": "Thu Sep 19",
        "Title": "James 1:9-18",
        "Abbreviated": "Jas.1",
        "Xreference": "['1Pet.1.6-1Pet.1.8', 'Prov.17.27', 'Jas.1.12', 'John.3.27', 'Rom.2.13']",
        "Tags": "\"Let the lowly brother boast in his exaltation, and the rich in his humiliation, because like a flower of the grass he will pass away.\" (James 1:9-10)\n\nThis verse highlights the theme of humility before God and the transient nature of earthly wealth, encouraging believers to find their identity and hope beyond material status."
    },
    {
        "Date": "Fri Sep 20",
        "Title": "James 1:19-27",
        "Abbreviated": "Jas.1",
        "Xreference": "['1Pet.1.6-1Pet.1.8', 'Prov.17.27', 'Jas.1.12', 'John.3.27', 'Rom.2.13']",
        "Tags": "\"Know this, my beloved brothers: let every person be quick to hear, slow to speak, slow to anger; for the anger of man does not produce the righteousness of God.\" (James 1:19-20)\n\nThis verse highlights the importance of being attentive and measured in our responses, suggesting that self-control and understanding lead to a more righteous life aligned with God's will."
    },
    {
        "Date": "Sat Sep 21",
        "Title": "Psalm 44",
        "Abbreviated": "Ps.44",
        "Xreference": "['Rom.8.36', 'Deut.7.7-Deut.7.8', 'Ps.108.13', 'Jer.17.10', 'Deut.8.17-Deut.8.18']",
        "Tags": "\"Rise up; help us! Redeem us for the sake of your steadfast love!\" (Psalm 44:26)\n\nThis verse highlights a plea for divine intervention and redemption, underscoring the deep reliance on God's unfailing love during times of distress and hardship."
    },
    {
        "Date": "Sun Sep 22",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Sep 23",
        "Title": "James 2:1-7",
        "Abbreviated": "Jas.2",
        "Xreference": "['Gal.3.10', 'Matt.5.3', 'Matt.7.26-Matt.7.27', 'Prov.24.23', 'Gen.15.6']",
        "Tags": "\"My brothers, show no partiality as you hold the faith in our Lord Jesus Christ, the Lord of glory.\" (James 2:1)\n\nThis verse underscores the critical principle that, as believers, showing favoritism or discrimination goes against the core tenet of faith in Christ, who embraces all."
    },
    {
        "Date": "Tue Sep 24",
        "Title": "James 2:8-13",
        "Abbreviated": "Jas.2",
        "Xreference": "['Gal.3.10', 'Matt.5.3', 'Matt.7.26-Matt.7.27', 'Prov.24.23', 'Gen.15.6']",
        "Tags": "\"If you really fulfill the royal law according to the Scripture, ‘You shall love your neighbor as yourself,’ you are doing well.\" (James 2:8)\n\nThis verse highlights the command to love others as a foundational principle of Christian ethics, emphasizing that love is central to fulfilling God's law."
    },
    {
        "Date": "Wed Sep 25",
        "Title": "James 2:14-26",
        "Abbreviated": "Jas.2",
        "Xreference": "['Gal.3.10', 'Matt.5.3', 'Matt.7.26-Matt.7.27', 'Prov.24.23', 'Gen.15.6']",
        "Tags": "\"Faith by itself, if it does not have works, is dead.\" (James 2:17)\n\nThis verse highlights the essential relationship between faith and action, asserting that genuine faith must be accompanied by good works to be considered alive and meaningful."
    },
    {
        "Date": "Thu Sep 26",
        "Title": "James 3:1-12",
        "Abbreviated": "Jas.3",
        "Xreference": "['Gal.5.22-Gal.5.23', 'Ps.120.2-Ps.120.3', 'Gal.5.23', 'Prov.2.6', 'Jas.3.17']",
        "Tags": "\"With the tongue we praise our Lord and Father, and with it we curse human beings, who have been made in God’s likeness.\" (James 3:9)\n\nThis verse underscores the duality of the tongue's use – it can bring both blessing and cursing, highlighting the moral responsibility of our speech and its impact on others."
    },
    {
        "Date": "Fri Sep 27",
        "Title": "James 3:13-18",
        "Abbreviated": "Jas.3",
        "Xreference": "['Gal.5.22-Gal.5.23', 'Ps.120.2-Ps.120.3', 'Gal.5.23', 'Prov.2.6', 'Jas.3.17']",
        "Tags": "\"Who is wise and understanding among you? By his good conduct let him show his works in the meekness of wisdom.\" (James 3:13)\n\nThis verse highlights the importance of wisdom being demonstrated through actions and character, particularly the virtue of humility in one's conduct."
    },
    {
        "Date": "Sat Sep 28",
        "Title": "James 4:1-6",
        "Abbreviated": "Jas.4",
        "Xreference": "['1Pet.5.8-1Pet.5.9', 'Ps.145.18', 'Eph.4.27', 'Heb.10.22', 'Mal.3.7']",
        "Tags": "\"God opposes the proud but gives grace to the humble.\" (James 4:6)\n\nThis verse is significant as it highlights the contrast between pride and humility, emphasizing that true strength and favor from God come through humility rather than arrogance."
    },
    {
        "Date": "Sun Sep 29",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Sep 30",
        "Title": "James 4:7-12",
        "Abbreviated": "Jas.4",
        "Xreference": "['1Pet.5.8-1Pet.5.9', 'Ps.145.18', 'Eph.4.27', 'Heb.10.22', 'Mal.3.7']",
        "Tags": "\"Submit yourselves therefore to God. Resist the devil, and he will flee from you.\" (James 4:7)\n\nThis verse highlights the importance of submitting to God and the power of resistance against evil, assuring believers that their faith can lead to victory over temptation."
    },
    {
        "Date": "Tue Oct 1",
        "Title": "James 4:13-17",
        "Abbreviated": "Jas.4",
        "Xreference": "['1Pet.5.8-1Pet.5.9', 'Ps.145.18', 'Eph.4.27', 'Heb.10.22', 'Mal.3.7']",
        "Tags": "\"Come now, you who say, ‘Today or tomorrow we will go into such and such a town and spend a year there and trade and make a profit’—yet you do not know what tomorrow will bring.\" (James 4:13-14)\n\nThis verse highlights the uncertainty of life and the importance of humility in our plans, reminding us that we cannot predict the future and should instead submit our desires to God's will."
    },
    {
        "Date": "Wed Oct 2",
        "Title": "James 5:1-6",
        "Abbreviated": "Jas.5",
        "Xreference": "['Jer.29.12-Jer.29.13', 'Prov.15.29', 'Matt.21.22', 'Ps.34.15', 'John.9.31']",
        "Tags": "\"Come now, you rich, weep and howl for the miseries that are coming upon you.\" (James 5:1)\n\nThis verse serves as a powerful warning to the wealthy about the impending judgment they face due to their unjust practices and exploitation of the poor."
    },
    {
        "Date": "Thu Oct 3",
        "Title": "James 5:6-12",
        "Abbreviated": "Jas.5",
        "Xreference": "['Jer.29.12-Jer.29.13', 'Prov.15.29', 'Matt.21.22', 'Ps.34.15', 'John.9.31']",
        "Tags": "\"Behold, we consider those blessed who remained steadfast. You have heard of the steadfastness of Job, and you have seen the purpose of the Lord, how the Lord is compassionate and merciful.\" (James 5:11)\n\nThis verse highlights the value of perseverance in faith and demonstrates God’s compassion and mercy towards those who endure suffering, using Job as a prime example of steadfastness."
    },
    {
        "Date": "Fri Oct 4",
        "Title": "James 5:13-20",
        "Abbreviated": "Jas.5",
        "Xreference": "['Jer.29.12-Jer.29.13', 'Prov.15.29', 'Matt.21.22', 'Ps.34.15', 'John.9.31']",
        "Tags": "\"Is anyone among you suffering? Let him pray. Is anyone cheerful? Let him sing praise.\" (James 5:13)\n\nThis verse highlights the importance of seeking God in both times of trouble and joy, underscoring prayer and praise as essential responses to life's circumstances."
    },
    {
        "Date": "Sat Oct 5",
        "Title": "Psalm 31",
        "Abbreviated": "Ps.31",
        "Xreference": "['1Cor.2.9', 'Isa.64.4', 'Lam.3.23-Lam.3.25', '1Pet.1.4-1Pet.1.5', 'Col.3.2-Col.3.4']",
        "Tags": "\"Be strong and take heart, all you who hope in the Lord.\" (Psalm 31:24)\n\nThis verse encourages believers to remain steadfast and courageous, reinforcing the strength that comes from placing one’s hope in God, especially during challenging times."
    },
    {
        "Date": "Sun Oct 6",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Oct 7",
        "Title": "Nahum 1:1-6",
        "Abbreviated": "Nah.1",
        "Xreference": "['2Tim.2.19', 'John.10.27', 'Lam.3.25', 'John.10.14', 'Ps.91.1-Ps.91.2']",
        "Tags": "\"His wrath is poured out like fire, and the rocks are broken into pieces by him.\" (Nahum 1:6)\n\nThis verse highlights the intensity of God's judgment and power against His enemies, serving as a reminder of His sovereignty and the seriousness of divine retribution."
    },
    {
        "Date": "Tue Oct 8",
        "Title": "Nahum 1:7-15",
        "Abbreviated": "Nah.1",
        "Xreference": "['2Tim.2.19', 'John.10.27', 'Lam.3.25', 'John.10.14', 'Ps.91.1-Ps.91.2']",
        "Tags": "\"The LORD is good, a refuge in times of trouble. He cares for those who trust in him.\" (Nahum 1:7)\n\nThis verse highlights God's protective nature and faithfulness, assuring believers that in difficult times, they can find safety and comfort in Him."
    },
    {
        "Date": "Wed Oct 9",
        "Title": "Nahum 2",
        "Abbreviated": "Nah.2",
        "Xreference": "[]",
        "Tags": "\"Behold, I am against you, declares the Lord of hosts, and I will burn your chariots in smoke, and the sword shall devour your young lions; I will cut off your prey from the earth, and the voice of your messengers shall no more be heard.\" (Nahum 2:13)\n\nThis verse underscores God's declaration of judgment against Nineveh, illustrating His power and the inevitability of destruction for those who oppose Him."
    },
    {
        "Date": "Thu Oct 10",
        "Title": "Nahum 3:1-10",
        "Abbreviated": "Nah.3",
        "Xreference": "[]",
        "Tags": "\"Woe to the bloody city, all full of lies and plunder—no end to the prey!\" (Nahum 3:1)\n\nThis verse captures the essence of Nahum's message against Nineveh, condemning its violence and deceit while highlighting the impending judgment that would come upon the city for its sins."
    },
    {
        "Date": "Fri Oct 11",
        "Title": "Nahum 3:11-19",
        "Abbreviated": "Nah.3",
        "Xreference": "[]",
        "Tags": "\"Yet she became an exile; she went into captivity. Her infants were dashed to pieces at the head of every street; for her honored men lots were cast, and all her great men were bound in chains.\" (Nahum 3:10)\n\nThis verse powerfully illustrates the consequences of Nineveh's violent and oppressive actions, highlighting the theme of divine judgment and retribution in the book of Nahum."
    },
    {
        "Date": "Sat Oct 12",
        "Title": "Psalm 14",
        "Abbreviated": "Ps.14",
        "Xreference": "['Rom.3.10-Rom.3.12', 'Isa.53.6', 'Isa.64.6', 'Jer.29.12-Jer.29.13', 'Rom.3.23']",
        "Tags": "\"The fool says in his heart, 'There is no God.'\" (Psalm 14:1)\n\nThis verse captures the profound theme of the folly of denying God’s existence, underscoring the importance of faith and recognition of divine authority in life."
    },
    {
        "Date": "Sun Oct 13",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Oct 14",
        "Title": "John 1:1-18",
        "Abbreviated": "John.1",
        "Xreference": "['1John.2.3-1John.2.5', 'Acts.4.12', 'John.10.9', '1John.5.2-1John.5.3', 'John.14.21-John.14.24']",
        "Tags": "\"In the beginning was the Word, and the Word was with God, and the Word was God.\" (John 1:1)\n\nThis verse is significant because it establishes the foundational Christian belief in the divinity of Christ and His eternal existence with God, underscoring the profound relationship between the Word (Logos) and God Himself."
    },
    {
        "Date": "Tue Oct 15",
        "Title": "John 1:19-28",
        "Abbreviated": "John.1",
        "Xreference": "['1John.2.3-1John.2.5', 'Acts.4.12', 'John.10.9', '1John.5.2-1John.5.3', 'John.14.21-John.14.24']",
        "Tags": "\"John answered them, 'I baptize with water, but among you stands one you do not know, even he who comes after me, the strap of whose sandal I am not worthy to untie.'\" (John 1:26-27)\n\nThis verse highlights John the Baptist's humility and his recognition of the greater significance of Jesus, emphasizing the transition from the old covenant to the new one brought by Christ."
    },
    {
        "Date": "Wed Oct 16",
        "Title": "John 1:29-51",
        "Abbreviated": "John.1",
        "Xreference": "['1John.2.3-1John.2.5', 'Acts.4.12', 'John.10.9', '1John.5.2-1John.5.3', 'John.14.21-John.14.24']",
        "Tags": "\"Behold, the Lamb of God, who takes away the sin of the world!\" (John 1:29)\n\nThis verse is significant because it identifies Jesus as the sacrificial offering for humanity's sins, highlighting the central theme of redemption in the Christian faith."
    },
    {
        "Date": "Thu Oct 17",
        "Title": "John 2",
        "Abbreviated": "John.2",
        "Xreference": "['Ps.69.9', '1Pet.1.8', '2Cor.5.7', 'Ps.119.139', 'Heb.11.1']",
        "Tags": "\"Jesus said to her, 'Woman, what does this have to do with me? My hour has not yet come.'\" (John 2:4)\n\nThis verse is significant as it marks the beginning of Jesus' public ministry, indicating both his awareness of his mission and the timing of his miraculous works, while also highlighting his relationship with his mother, Mary."
    },
    {
        "Date": "Fri Oct 18",
        "Title": "John 3:1-21",
        "Abbreviated": "John.3",
        "Xreference": "['Rom.5.8', '1John.4.9-1John.4.10', 'John.3.15', 'Rom.8.32', 'John.11.25-John.11.26']",
        "Tags": "\" For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life.\" (John 3:16)\n\nThis verse is significant because it encapsulates the core message of Christianity: God's love for humanity and the promise of eternal life through faith in Jesus Christ."
    },
    {
        "Date": "Sat Oct 19",
        "Title": "Psalm 53",
        "Abbreviated": "Ps.53",
        "Xreference": "['Isa.55.6']",
        "Tags": "\"The fool says in his heart, 'There is no God.'\" (Psalm 53:1)\n\nThis verse emphasizes the folly of disbelief and highlights the importance of acknowledging God's existence as foundational to wisdom."
    },
    {
        "Date": "Sun Oct 20",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"Blessed are the meek, for they shall inherit the earth.\" (Matthew 5:5)\n\nThis verse underscores the value of humility and gentleness, highlighting that those who possess these qualities will ultimately receive great rewards."
    },
    {
        "Date": "Mon Oct 21",
        "Title": "John 3:22-36",
        "Abbreviated": "John.3",
        "Xreference": "['Rom.5.8', '1John.4.9-1John.4.10', 'John.3.15', 'Rom.8.32', 'John.11.25-John.11.26']",
        "Tags": "\"The one who comes from above is above all; the one who is from the earth belongs to the earth and speaks as one from the earth. The one who comes from heaven is above all.\" (John 3:31)\n\nThis verse underscores the divine authority of Jesus, highlighting His heavenly origin and superiority over earthly beings."
    },
    {
        "Date": "Tue Oct 22",
        "Title": "John 4:1-38",
        "Abbreviated": "John.4",
        "Xreference": "['2Cor.3.17', 'John.7.38-John.7.39', 'John.4.14', 'Matt.15.8-Matt.15.9', 'Rev.7.17']",
        "Tags": "\"Yet a time is coming and has now come when the true worshipers will worship the Father in the Spirit and in truth, for they are the kind of worshipers the Father seeks.\" (John 4:23)\n\nThis verse highlights the importance of genuine worship, emphasizing that true worshipers connect with God not merely through rituals, but through a heartfelt and truthful relationship in the Spirit."
    },
    {
        "Date": "Wed Oct 23",
        "Title": "John 4:39-54",
        "Abbreviated": "John.4",
        "Xreference": "['2Cor.3.17', 'John.7.38-John.7.39', 'John.4.14', 'Matt.15.8-Matt.15.9', 'Rev.7.17']",
        "Tags": "\"Many Samaritans from that town believed in him because of the woman's testimony, 'He told me all that I ever did.'\" (John 4:39)\n\nThis verse is significant because it highlights the powerful impact of personal testimony in leading others to faith and demonstrates that Jesus' influence extends beyond traditional boundaries, as it sparked belief among the Samaritans."
    },
    {
        "Date": "Thu Oct 24",
        "Title": "John 5:1-15",
        "Abbreviated": "John.5",
        "Xreference": "['Deut.18.15', 'Deut.18.18-Deut.18.19', 'John.12.49', 'John.3.36', 'John.8.28']",
        "Tags": "\"After this there was a feast of the Jews, and Jesus went up to Jerusalem.\" (John 5:1)\n\nThis verse is significant as it sets the context for the events that follow in the passage, highlighting Jesus' presence in Jerusalem and foreshadowing the miraculous healing that will unfold at the pool of Bethesda."
    },
    {
        "Date": "Fri Oct 25",
        "Title": "John 5:16-30",
        "Abbreviated": "John.5",
        "Xreference": "['Deut.18.15', 'Deut.18.18-Deut.18.19', 'John.12.49', 'John.3.36', 'John.8.28']",
        "Tags": "\"16 And this was why the Jews were persecuting Jesus, because he was doing these things on the Sabbath. 17 But Jesus answered them, 'My Father is working until now, and I am working.' 18 This was why the Jews were seeking all the more to kill him, because not only was he breaking the Sabbath, but he was even calling God his own Father, making himself equal with God. 19 So Jesus said to them, 'Truly, truly, I say"
    },
    {
        "Date": "Sat Oct 26",
        "Title": "Psalm 62",
        "Abbreviated": "Ps.62",
        "Xreference": "['Ps.3.3', 'Phil.4.6', 'Mic.7.7', 'Matt.16.27', 'Isa.26.4']",
        "Tags": "\"My soul waits in silence for God alone; from Him comes my salvation.\" (Psalm 62:1)\n\nThis verse encapsulates the theme of trust and reliance on God, highlighting the importance of finding peace and hope in Him alone during times of need."
    },
    {
        "Date": "Sun Oct 27",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Oct 28",
        "Title": "John 5:31-47",
        "Abbreviated": "John.5",
        "Xreference": "['Deut.18.15', 'Deut.18.18-Deut.18.19', 'John.12.49', 'John.3.36', 'John.8.28']",
        "Tags": "\"Do not think that I will accuse you to the Father; there is one who accuses you: Moses, on whom you have set your hope.\" (John 5:45)\n\nThis verse is significant as it highlights the central role of the Scriptures, particularly the Law of Moses, in revealing the accountability of the Jews before God and underscores the importance of believing in Jesus as the fulfillment of those Scriptures."
    },
    {
        "Date": "Tue Oct 29",
        "Title": "John 6:1-21",
        "Abbreviated": "John.6",
        "Xreference": "['Isa.54.13', 'Jer.31.33-Jer.31.34', 'Heb.10.16', 'John.6.65', 'Heb.8.10-Heb.8.11']",
        "Tags": "\"Then Jesus declared, 'I am the bread of life. Whoever comes to me will never go hungry, and whoever believes in me will never be thirsty.'\" (John 6:35)\n\nThis verse is significant because it encapsulates the core message of Jesus as the source of spiritual sustenance and eternal fulfillment for those who believe in Him."
    },
    {
        "Date": "Wed Oct 30",
        "Title": "John 6:22-59",
        "Abbreviated": "John.6",
        "Xreference": "['Isa.54.13', 'Jer.31.33-Jer.31.34', 'Heb.10.16', 'John.6.65', 'Heb.8.10-Heb.8.11']",
        "Tags": "\"Jesus said to them, 'I am the bread of life; whoever comes to me shall not hunger, and whoever believes in me shall never thirst.'\" (John 6:35)\n\nThis verse is significant as it underscores the central theme of Jesus as the sustainer of spiritual life, highlighting the deep reliance on faith and belief in him for true fulfillment and nourishment."
    },
    {
        "Date": "Thu Oct 31",
        "Title": "John 6:60-71",
        "Abbreviated": "John.6",
        "Xreference": "['Isa.54.13', 'Jer.31.33-Jer.31.34', 'Heb.10.16', 'John.6.65', 'Heb.8.10-Heb.8.11']",
        "Tags": "\"After this, many of his disciples turned back and no longer walked with him.\" (John 6:66)\n\nThis verse is significant because it highlights the turning point for many of Jesus' followers who could not accept his teachings, reflecting the challenge of discipleship and the cost of true faith."
    },
    {
        "Date": "Fri Nov 1",
        "Title": "John 7:1-24",
        "Abbreviated": "John.7",
        "Xreference": "['John.4.14', 'Isa.58.11', 'Isa.44.3', 'John.7.8', 'John.2.4']",
        "Tags": "\"Do not judge by appearances, but judge with right judgment.\" (John 7:24)\n\nThis verse highlights the importance of discerning true intentions and understanding beyond superficial judgments, urging individuals to seek deeper truths."
    },
    {
        "Date": "Sat Nov 2",
        "Title": "Psalm 67",
        "Abbreviated": "Ps.67",
        "Xreference": "['Ps.4.6', '2Cor.4.6', 'Ps.98.9', 'Titus.2.11']",
        "Tags": "\"Let the peoples praise you, O God; let all the peoples praise you!\" (Psalm 67:3)\n\nThis verse highlights the universal call for all nations to worship and acknowledge God's greatness, emphasizing the importance of praise in fostering a sense of unity and divine recognition among humanity."
    },
    {
        "Date": "Sun Nov 3",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Nov 4",
        "Title": "John 7:25-39",
        "Abbreviated": "John.7",
        "Xreference": "['John.4.14', 'Isa.58.11', 'Isa.44.3', 'John.7.8', 'John.2.4']",
        "Tags": "\"On the last day of the feast, the great day, Jesus stood up and cried out, 'If anyone thirsts, let him come to me and drink.'\" (John 7:37)\n\nThis verse is significant because it highlights Jesus as the source of spiritual fulfillment and invites all who are spiritually thirsty to find satisfaction in Him."
    },
    {
        "Date": "Tue Nov 5",
        "Title": "John 7:40-53",
        "Abbreviated": "John.7",
        "Xreference": "['John.4.14', 'Isa.58.11', 'Isa.44.3', 'John.7.8', 'John.2.4']",
        "Tags": "\"Some of the people of Jerusalem therefore said, 'Is not this the man whom they seek to kill?'\" (John 7:25)\n\nThis verse highlights the growing tension surrounding Jesus' identity and mission, illustrating the divide between public perception and the religious leaders' intentions."
    },
    {
        "Date": "Wed Nov 6",
        "Title": "John 8:1-30",
        "Abbreviated": "John.8",
        "Xreference": "['John.12.46', 'John.12.49', 'John.9.5', 'John.14.10', 'John.12.35']",
        "Tags": "\"Then neither do I condemn you,\" Jesus declared. \"Go now and leave your life of sin.\" (John 8:11)\n\nThis verse captures the essence of Jesus' message of grace and forgiveness, highlighting His ability to offer redemption while also encouraging a transformative change in one's life."
    },
    {
        "Date": "Thu Nov 7",
        "Title": "John 8:31-59",
        "Abbreviated": "John.8",
        "Xreference": "['John.12.46', 'John.12.49', 'John.9.5', 'John.14.10', 'John.12.35']",
        "Tags": "\"Then you will know the truth, and the truth will set you free.\" (John 8:32)\n\nThis verse highlights the liberating power of truth, indicating that genuine understanding and acceptance of truth lead to spiritual freedom and enlightenment."
    },
    {
        "Date": "Fri Nov 8",
        "Title": "John 9:1-34",
        "Abbreviated": "John.9",
        "Xreference": "['John.12.35', 'John.4.34', 'Eph.5.16', 'Eccl.9.10', 'Prov.15.29']",
        "Tags": "\"Jesus answered, 'It was not that this man sinned, or his parents, but that the works of God might be displayed in him.'\" (John 9:3)\n\nThis verse highlights the theme of divine purpose in suffering and the opportunity for God's power and glory to be manifested through our challenges."
    },
    {
        "Date": "Sat Nov 9",
        "Title": "Psalm 74",
        "Abbreviated": "Ps.74",
        "Xreference": "['Deut.32.8']",
        "Tags": "\"Why do you hold back your hand, your right hand? Take it from the fold of your garment and destroy them!\" (Psalm 74:11)\n\nThis verse expresses a deep yearning for divine intervention in the face of oppression and injustice, highlighting the psalmist's plea for God to act decisively on behalf of His people."
    },
    {
        "Date": "Sun Nov 10",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Nov 11",
        "Title": "John 9:35-41",
        "Abbreviated": "John.9",
        "Xreference": "['John.12.35', 'John.4.34', 'Eph.5.16', 'Eccl.9.10', 'Prov.15.29']",
        "Tags": "\"Jesus heard that they had cast him out, and having found him, he said, 'Do you believe in the Son of Man?'\" (John 9:35)\n\nThis verse is significant as it highlights Jesus' compassion for the man born blind, affirming his identity as the Messiah and offering the opportunity for spiritual belief and healing."
    },
    {
        "Date": "Tue Nov 12",
        "Title": "John 10:1-21",
        "Abbreviated": "John.10",
        "Xreference": "['Luke.19.10', 'John.6.51', 'John.12.47', 'Ps.82.6-Ps.82.7', 'John.6.33']",
        "Tags": "\"I am the good shepherd. The good shepherd lays down his life for the sheep.\" (John 10:11)\n\nThis verse is significant because it highlights Jesus' sacrificial love and commitment to his followers, illustrating the depth of his care and the relationship between him and his people."
    },
    {
        "Date": "Wed Nov 13",
        "Title": "John 10:22-42",
        "Abbreviated": "John.10",
        "Xreference": "['Luke.19.10', 'John.6.51', 'John.12.47', 'Ps.82.6-Ps.82.7', 'John.6.33']",
        "Tags": "The most significant verse from John 10:22-42 is, \"I and the Father are one.\" (John 10:30)\n\nThis verse highlights the unity and divine relationship between Jesus and God the Father, which is central to Christian theology and the understanding of Christ's divine nature."
    },
    {
        "Date": "Thu Nov 14",
        "Title": "John 11:1-27",
        "Abbreviated": "John.11",
        "Xreference": "['1Thess.4.14', 'John.3.36', '1John.5.11-1John.5.12', 'John.1.4', 'John.5.21']",
        "Tags": "\"I am the resurrection and the life. Whoever believes in me, though he die, yet shall he live.\" (John 11:25)\n\nThis verse is significant because it profoundly encapsulates the promise of eternal life through faith in Jesus, highlighting His divine authority over life and death."
    },
    {
        "Date": "Fri Nov 15",
        "Title": "John 11:28-44",
        "Abbreviated": "John.11",
        "Xreference": "['1Thess.4.14', 'John.3.36', '1John.5.11-1John.5.12', 'John.1.4', 'John.5.21']",
        "Tags": "\"Jesus said to her, 'Did I not tell you that if you believed you would see the glory of God?'\" (John 11:40)\n\nThis verse highlights the importance of faith in witnessing God's power and glory, as demonstrated through the miracle of Lazarus' resurrection."
    },
    {
        "Date": "Sat Nov 16",
        "Title": "Psalm 106",
        "Abbreviated": "Ps.106",
        "Xreference": "['1Thess.5.18', 'Ps.105.1', 'Ps.119.132', '1Chr.16.34', 'Luke.23.42']",
        "Tags": "\"Nevertheless, he saved them for his name's sake, that he might make his mighty power known.\" (Psalm 106:8)\n\nThis verse highlights God's mercy and faithfulness to His people, demonstrating how His actions are rooted in His nature and purpose, even in the face of their unfaithfulness."
    },
    {
        "Date": "Sun Nov 17",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Nov 18",
        "Title": "John 11:45-57",
        "Abbreviated": "John.11",
        "Xreference": "['1Thess.4.14', 'John.3.36', '1John.5.11-1John.5.12', 'John.1.4', 'John.5.21']",
        "Tags": "\"And many of the Jews who had come to Mary and had seen what he did believed in him.\" (John 11:45)\n\nThis verse highlights the powerful impact of Jesus' miracle of raising Lazarus from the dead, leading many to believe in Him and emphasizing the theme of faith in the miraculous."
    },
    {
        "Date": "Tue Nov 19",
        "Title": "John 12:1-19",
        "Abbreviated": "John.12",
        "Xreference": "['1Cor.15.36-1Cor.15.38', 'John.8.12', 'Zech.9.9', 'Isa.6.10', 'Ps.36.9']",
        "Tags": "\"Fear not, daughter of Zion; behold, your king is coming, sitting on a donkey's colt.\" (John 12:15)\n\nThis verse is significant as it highlights the fulfillment of prophecy regarding Jesus' humble entry into Jerusalem, showcasing His identity as the Messiah and the king who brings peace."
    },
    {
        "Date": "Wed Nov 20",
        "Title": "John 12:20-36",
        "Abbreviated": "John.12",
        "Xreference": "['1Cor.15.36-1Cor.15.38', 'John.8.12', 'Zech.9.9', 'Isa.6.10', 'Ps.36.9']",
        "Tags": "\"And I, when I am lifted up from the earth, will draw all people to myself.” (John 12:32)\n\nThis verse is significant as it foreshadows Jesus' crucifixion and highlights the universal appeal of His sacrifice, inviting all people to come to Him for salvation."
    },
    {
        "Date": "Thu Nov 21",
        "Title": "John 12:37-50",
        "Abbreviated": "John.12",
        "Xreference": "['1Cor.15.36-1Cor.15.38', 'John.8.12', 'Zech.9.9', 'Isa.6.10', 'Ps.36.9']",
        "Tags": "\"And though he had done so many signs before them, yet they believed not on him.\" (John 12:37)\n\nThis verse highlights the disbelief of many despite witnessing Jesus' miraculous works, underscoring the theme of rejection and the human heart's resistance to faith."
    },
    {
        "Date": "Fri Nov 22",
        "Title": "John 13:1-20",
        "Abbreviated": "John.13",
        "Xreference": "['Eph.5.2', 'Lev.19.18', 'Ps.41.9', 'John.15.17', '1John.4.20-1John.4.21']",
        "Tags": "\"Now before the Feast of the Passover, when Jesus knew that his hour had come to depart out of this world to the Father, having loved his own who were in the world, he loved them to the end.\" (John 13:1)\n\nThis verse highlights Jesus’ deep love and commitment to His disciples, exemplifying the profound nature of His sacrifice and the intimate relationship He shares with His followers."
    },
    {
        "Date": "Sat Nov 23",
        "Title": "Psalm 79",
        "Abbreviated": "Ps.79",
        "Xreference": "['Ps.102.20', 'Jer.14.7']",
        "Tags": "\"Help us, O God of our salvation, for the glory of your name; deliver us, and atone for our sins, for your name's sake!\" (Psalm 79:9)\n\nThis verse is significant as it highlights the urgent plea for divine assistance and forgiveness, underlining both God's glory and the deep reliance on His mercy in times of distress."
    },
    {
        "Date": "Sun Nov 24",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Nov 25",
        "Title": "John 13:21-38",
        "Abbreviated": "John.13",
        "Xreference": "['Eph.5.2', 'Lev.19.18', 'Ps.41.9', 'John.15.17', '1John.4.20-1John.4.21']",
        "Tags": "\"Very truly I tell you, one of you is going to betray me.\" (John 13:21)\n\nThis verse is significant as it foreshadows the betrayal of Jesus by Judas Iscariot, highlighting the themes of loyalty and betrayal that are central to the Passion narrative."
    },
    {
        "Date": "Tue Nov 26",
        "Title": "John 14:1-14",
        "Abbreviated": "John.14",
        "Xreference": "['1John.2.3-1John.2.5', 'Acts.4.12', 'John.10.9', '1John.5.2-1John.5.3', 'John.14.21-John.14.24']",
        "Tags": "\"Let not your hearts be troubled. Believe in God; believe also in me.\" (John 14:1)\n\nThis verse is significant as it offers comfort and reassurance from Jesus, encouraging faith in both God and Himself during times of distress and uncertainty."
    },
    {
        "Date": "Wed Nov 27",
        "Title": "John 14:15-31",
        "Abbreviated": "John.14",
        "Xreference": "['1John.2.3-1John.2.5', 'Acts.4.12', 'John.10.9', '1John.5.2-1John.5.3', 'John.14.21-John.14.24']",
        "Tags": "\" If you love me, you will keep my commandments.\" (John 14:15)\n\nThis verse highlights the deep connection between love for Jesus and the obedience to His teachings, underscoring the essence of a committed faith."
    },
    {
        "Date": "Thu Nov 28",
        "Title": "John 15:1-17",
        "Abbreviated": "John.15",
        "Xreference": "['Phil.4.13', 'Ps.37.4', 'Col.1.10', '1John.5.14', 'John.15.16']",
        "Tags": "\"I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing.\" (John 15:5)\n\nThis verse underscores the vital relationship between Jesus and His followers, illustrating that true spiritual vitality and productivity can only be achieved through staying connected to Him."
    },
    {
        "Date": "Fri Nov 29",
        "Title": "John 15:18-27",
        "Abbreviated": "John.15",
        "Xreference": "['Phil.4.13', 'Ps.37.4', 'Col.1.10', '1John.5.14', 'John.15.16']",
        "Tags": "\"If the world hates you, know that it has hated me before it hated you.\" (John 15:18)\n\nThis verse highlights the concept of persecution for one's beliefs, reminding believers that their challenges in the world reflect the treatment Jesus faced during His ministry."
    },
    {
        "Date": "Sat Nov 30",
        "Title": "Luke 2:22-38",
        "Abbreviated": "Luke.2",
        "Xreference": "['Matt.5.44', 'Ps.31.5', 'Acts.7.59', 'Acts.7.60', '1Pet.3.9']",
        "Tags": "\"And when the time came for their purification according to the Law of Moses, they brought him up to Jerusalem to present him to the Lord.\" (Luke 2:22)\n\nThis verse highlights the obedience of Mary and Joseph to Jewish law, symbolizing the fulfillment of God's promises and the significance of Jesus' presentation in the temple as a pivotal moment in His early life."
    },
    {
        "Date": "Sun Dec 1",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Dec 2",
        "Title": "John 16:1-15",
        "Abbreviated": "John.16",
        "Xreference": "['John.14.27', '1John.5.4', '1John.4.4', '2Thess.3.16', 'John.14.26']",
        "Tags": "\"Nevertheless, I tell you the truth: it is to your advantage that I go away, for if I do not go away, the Helper will not come to you; but if I go, I will send him to you.\" (John 16:7)\n\nThis verse highlights the essential promise of the Holy Spirit, emphasizing that Jesus' departure is necessary for the coming of the Comforter, which enriches the lives of believers."
    },
    {
        "Date": "Tue Dec 3",
        "Title": "John 16:16-33",
        "Abbreviated": "John.16",
        "Xreference": "['John.14.27', '1John.5.4', '1John.4.4', '2Thess.3.16', 'John.14.26']",
        "Tags": "\"…and you will be sorrowful, but your sorrow will turn into joy.\" (John 16:20)\n\nThis verse underscores the transformative power of faith, revealing that moments of grief can lead to profound joy and hope in the face of adversity."
    },
    {
        "Date": "Wed Dec 4",
        "Title": "John 17",
        "Abbreviated": "John.17",
        "Xreference": "['1John.5.20', '1John.5.11-1John.5.12', 'John.15.3', 'Ps.119.160', 'John.17.25']",
        "Tags": "“Father, I desire that they also, whom You gave Me, may be with Me where I am, that they may behold My glory which You have given Me; for You loved Me before the foundation of the world.” (John 17:24)\n\nThis verse highlights Jesus’ deep desire for unity between Him and His followers, underscoring the intimate relationship He shares with the Father and the promise of eternal life for believers."
    },
    {
        "Date": "Thu Dec 5",
        "Title": "John 18:1-27",
        "Abbreviated": "John.18",
        "Xreference": "['John.8.47', '1John.4.6', 'John.17.12', 'Luke.17.20-Luke.17.21', 'John.8.14']",
        "Tags": "\"Then Jesus said to the chief priests, the officers of the temple, and the elders, who had come out against him, 'Have you come out as against a robber, with swords and clubs?'\" (John 18:3)\n\nThis verse is significant as it highlights the stark contrast between Jesus' peaceful demeanor and the aggressive approach of the authorities who arrested him, emphasizing the injustice of his betrayal and the nature of his mission."
    },
    {
        "Date": "Fri Dec 6",
        "Title": "John 18:28-40",
        "Abbreviated": "John.18",
        "Xreference": "['John.8.47', '1John.4.6', 'John.17.12', 'Luke.17.20-Luke.17.21', 'John.8.14']",
        "Tags": "\"Then Pilate said to Him, 'Are You a king then?' Jesus answered, 'You say rightly that I am a king. For this cause I was born, and for this cause I have come into the world, that I should bear witness to the truth. Everyone who is of the truth hears My voice.'\" (John 18:37)\n\nThis verse highlights Jesus’ role as the embodiment of truth and His purpose in revealing that truth to the world, emphasizing the profound implications of His"
    },
    {
        "Date": "Sat Dec 7",
        "Title": "Luke 2:8-14",
        "Abbreviated": "Luke.2",
        "Xreference": "['Matt.5.44', 'Ps.31.5', 'Acts.7.59', 'Acts.7.60', '1Pet.3.9']",
        "Tags": "\"Glory to God in the highest, and on earth peace among those with whom he is pleased!\" (Luke 2:14)\n\nThis verse is significant as it marks the proclamation of Jesus' birth by the angels, emphasizing the glory of God and the message of peace that Jesus brings to humanity."
    },
    {
        "Date": "Sun Dec 8",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"For an overseer, as God's steward, must be above reproach. He must not be arrogant or quick-tempered or a drunkard or violent or greedy for gain.\" (Titus 1:7)\n\nThis verse is significant as it highlights the essential qualities of integrity and self-control required for church leaders, serving as a guideline for their moral and ethical conduct."
    },
    {
        "Date": "Mon Dec 9",
        "Title": "John 19:1-16",
        "Abbreviated": "John.19",
        "Xreference": "['Ps.69.21', 'John.17.4', 'Ps.22.15', 'Ps.22.18', 'Phil.2.8']",
        "Tags": "\"Then Pilate took Jesus and flogged Him.\" (John 19:1)\n\nThis verse is significant as it marks the beginning of Jesus’ physical suffering and highlights the brutality He endured before His crucifixion, emphasizing the gravity of the events leading up to His sacrifice."
    },
    {
        "Date": "Tue Dec 10",
        "Title": "John 19:17-42",
        "Abbreviated": "John.19",
        "Xreference": "['Ps.69.21', 'John.17.4', 'Ps.22.15', 'Ps.22.18', 'Phil.2.8']",
        "Tags": "\"Carrying his own cross, he went out to the place of the Skull (which in Aramaic is called Golgotha).\" (John 19:17)\n\nThis verse is significant as it marks the moment when Jesus willingly accepts the burden of the cross, symbolizing his sacrificial love and the fulfillment of prophecy in his journey toward crucifixion."
    },
    {
        "Date": "Wed Dec 11",
        "Title": "John 20:1-18",
        "Abbreviated": "John.20",
        "Xreference": "['1Pet.1.8', '2Cor.5.7', 'Heb.11.1', 'Acts.10.43', 'John.3.15-John.3.16']",
        "Tags": "\"Mary Magdalene went to the disciples with the news: 'I have seen the Lord!' \" (John 20:18)\n\nThis verse is significant because it captures the pivotal moment of Mary's encounter with the resurrected Jesus, marking her as the first to witness and proclaim the resurrection, thus emphasizing the importance of her role in the early Christian community."
    },
    {
        "Date": "Thu Dec 12",
        "Title": "John 20:19-31",
        "Abbreviated": "John.20",
        "Xreference": "['1Pet.1.8', '2Cor.5.7', 'Heb.11.1', 'Acts.10.43', 'John.3.15-John.3.16']",
        "Tags": "\"Jesus said to them again, 'Peace be with you. As the Father has sent me, even so I am sending you.'\" (John 20:21)\n\nThis verse is significant as it highlights the mission of Jesus' followers to continue His work in the world, emphasizing themes of peace and the responsibility of believers to spread the message of the Gospel."
    },
    {
        "Date": "Fri Dec 13",
        "Title": "John 21",
        "Abbreviated": "John.21",
        "Xreference": "['Ps.40.5', 'John.20.30-John.20.31', 'Luke.5.4-Luke.5.7', 'Ps.71.15', 'Rom.15.1']",
        "Tags": "\"Jesus said to Simon Peter, 'Simon, son of John, do you love me more than these?' He said to him, 'Yes, Lord; you know that I love you.' He said to him, 'Feed my lambs.'\" (John 21:15)\n\nThis verse is significant because it highlights Jesus' call to Peter to take care of His followers and signifies the importance of love and commitment in leadership within the Christian faith."
    },
    {
        "Date": "Sat Dec 14",
        "Title": "Luke 2:15-20",
        "Abbreviated": "Luke.2",
        "Xreference": "['Matt.5.44', 'Ps.31.5', 'Acts.7.59', 'Acts.7.60', '1Pet.3.9']",
        "Tags": "\"And it came to pass, as the angels were gone away from them into heaven, the shepherds said one to another, 'Let us now go even unto Bethlehem, and see this thing which is come to pass, which the Lord hath made known unto us.'\" (Luke 2:15)\n\nThis verse highlights the shepherds' response to the angelic announcement of Christ's birth, emphasizing the importance of witnessing and sharing the message of Jesus' arrival."
    },
    {
        "Date": "Sun Dec 15",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": "\"For an overseer, as God's steward, must be above reproach. He must not be arrogant or quick-tempered or a drunkard or violent or greedy for gain.\" (Titus 1:7)\n\nThis verse is significant as it establishes essential qualities for leaders within the church, underlining the necessity of moral integrity and self-control in their leadership roles."
    },
    {
        "Date": "Mon Dec 16",
        "Title": "Colossians 1:1-23",
        "Abbreviated": "Col.1",
        "Xreference": "['Acts.26.18', 'Heb.1.3', 'Eph.5.8', '1Pet.2.9', 'Rom.11.36']",
        "Tags": "\"…in him all things were created, in heaven and on earth, visible and invisible, whether thrones or dominions or rulers or authorities— all things were created through him and for him.\" (Colossians 1:16)\n\nThis verse emphasizes the supremacy of Christ in creation, highlighting His central role in the universe and underlining the belief that everything exists for His purpose."
    },
    {
        "Date": "Tue Dec 17",
        "Title": "Colossians 1:24-2:3",
        "Abbreviated": "Col.1",
        "Xreference": "['Acts.26.18', 'Heb.1.3', 'Eph.5.8', '1Pet.2.9', 'Rom.11.36']",
        "Tags": "\"Now I rejoice in my sufferings for your sake, and in my flesh I am filling up what is lacking in Christ's afflictions for the sake of his body, that is, the church...\" (Colossians 1:24)\n\nThis verse highlights the Apostle Paul's understanding of the value of suffering within his ministry, emphasizing his dedication to the church and the idea that he participates in the redemptive suffering of Christ for the benefit of others."
    },
    {
        "Date": "Wed Dec 18",
        "Title": "Colossians 2:4-23",
        "Abbreviated": "Col.2",
        "Xreference": "['1Tim.6.20', 'Eph.3.17', 'Heb.2.14', 'Eph.5.6', 'Col.1.10']",
        "Tags": "\"These are a shadow of the things that were to come; the reality, however, is found in Christ.\" (Colossians 2:17)\n\nThis verse highlights the transition from the Old Covenant's practices to the fulfillment of those practices in Jesus Christ, emphasizing His central role in salvation and spiritual life."
    },
    {
        "Date": "Thu Dec 19",
        "Title": "Colossians 3:1-25",
        "Abbreviated": "Col.3",
        "Xreference": "['Col.3.17', 'Eph.6.6-Eph.6.7', '1Cor.10.31', 'Rom.8.6', '1John.2.15-1John.2.17']",
        "Tags": "\"If then you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God.\" (Colossians 3:1)\n\nThis verse is significant as it encourages believers to prioritize their spiritual life and focus on heavenly matters, reflecting the transformative power of being united with Christ."
    },
    {
        "Date": "Fri Dec 20",
        "Title": "Colossians 4:1-18",
        "Abbreviated": "Col.4",
        "Xreference": "['1Thess.5.17-1Thess.5.18', 'Eph.4.29', '1Pet.3.15', 'Phil.4.6', 'Eccl.10.12']",
        "Tags": "\"Devote yourselves to prayer, being watchful and thankful.\" (Colossians 4:2)\n\nThis verse highlights the importance of consistent prayer, encouraging believers to remain vigilant and grateful in their spiritual lives."
    },
    {
        "Date": "Sat Dec 21",
        "Title": "Matthew 1:18-25",
        "Abbreviated": "Matt.1",
        "Xreference": "['Matt.11.29', 'John.7.37', 'Isa.7.14', 'Ps.78.2', 'John.6.37']",
        "Tags": "\"She will bear a son, and you shall call his name Jesus, for he will save his people from their sins.\" (Matthew 1:21)\n\nThis verse is significant as it encapsulates the purpose of Jesus' coming into the world, highlighting the themes of salvation and the fulfillment of prophecy in Christian belief."
    },
    {
        "Date": "Sun Dec 22",
        "Title": "SERMON NOTES",
        "Abbreviated": "",
        "Xreference": "",
        "Tags": " "
    },
    {
        "Date": "Mon Dec 23",
        "Title": "Luke 1:1-25",
        "Abbreviated": "Luke.1",
        "Xreference": "['Mark.11.24', 'John.16.23-John.16.24', 'Matt.21.22', 'John.15.16', 'John.15.7']",
        "Tags": "\"Since many have undertaken to compile a narrative of the things that have been accomplished among us...\" (Luke 1:1)\n\nThis verse highlights the importance of recounting and preserving the events of Jesus' life and ministry, setting the stage for the purpose and credibility of Luke's Gospel."
    },
    {
        "Date": "Tue Dec 24",
        "Title": "Luke 1:26-56",
        "Abbreviated": "Luke.1",
        "Xreference": "['Mark.11.24', 'John.16.23-John.16.24', 'Matt.21.22', 'John.15.16', 'John.15.7']",
        "Tags": "\"Behold, I am the servant of the Lord; let it be to me according to your word.\" (Luke 1:38)\n\nThis verse is significant as it captures Mary's profound faith and willingness to accept God's plan for her life, serving as a powerful example of obedience and trust in divine purpose."
    },
    {
        "Date": "Wed Dec 25",
        "Title": "Luke 1:57-80",
        "Abbreviated": "Luke.1",
        "Xreference": "['Mark.11.24', 'John.16.23-John.16.24', 'Matt.21.22', 'John.15.16', 'John.15.7']",
        "Tags": "\"And the child grew and became strong in spirit, and he was in the wilderness until the day of his public appearance to Israel.\" (Luke 1:80)\n\nThis verse highlights the growth and preparation of John the Baptist before his important ministry, emphasizing the significance of spiritual strength and solitude in fulfilling one’s purpose."
    },
    {
        "Date": "Thu Dec 26",
        "Title": "Luke 2:1-20",
        "Abbreviated": "Luke.2",
        "Xreference": "['Matt.5.44', 'Ps.31.5', 'Acts.7.59', 'Acts.7.60', '1Pet.3.9']",
        "Tags": "\"And there were in the same country shepherds abiding in the field, keeping watch over their flock by night.\" (Luke 2:8)\n\nThis verse is significant as it introduces the humble shepherds as key witnesses to the birth of Jesus, highlighting the theme of God's revelation to the lowly and the inclusive nature of the Gospel."
    },
    {
        "Date": "Fri Dec 27",
        "Title": "Luke 2:21-52",
        "Abbreviated": "Luke.2",
        "Xreference": "['Matt.5.44', 'Ps.31.5', 'Acts.7.59', 'Acts.7.60', '1Pet.3.9']",
        "Tags": "\"Then he went down to Nazareth with them and was obedient to them. But his mother treasured all these things in her heart.\" (Luke 2:51)\n\nThis verse highlights the humility and obedience of Jesus during his youth, emphasizing the importance of family and the deep emotional bond between Mary and her son, which foreshadows the significance of Jesus' life and ministry."
    },
    {
        "Date": "Sat Dec 28",
        "Title": "Psalm 117",
        "Abbreviated": "Ps.117",
        "Xreference": "['Rom.15.11']",
        "Tags": "\"Praise the LORD, all you nations; extol him, all you peoples.\" (Psalm 117:1)\n\nThis verse highlights the universality of praise and the call for all nations and peoples to worship God, reflecting His sovereignty and love for all humanity."
    }
]